==================
basic block
==================

block_1 {
}

---

(config_file
  (body
    (block
      (identifier))))

==================
basic block on one line
==================

block_1 {}

---

(config_file
  (body
    (block
      (identifier))))

==================
block with attribute
==================

block_1 "strlit1" "strlit2" {
    attr1 = "val1"
}

---

(config_file
  (body
    (block
      (identifier)
      (string_lit (quoted_template))
      (string_lit (quoted_template))
      (body
        (attribute
          (identifier)
          (expression (expr_term (template_expr (quoted_template)))))))))

==================
nested block
==================

block_1 {
  block_2 {
  }
}

---

(config_file
  (body
    (block
      (identifier)
      (body
        (block
          (identifier))))))

==================
nested block on one line
==================

block_1 {
  block_2 {}
}

---

(config_file
  (body
    (block
      (identifier)
      (body
        (block
          (identifier))))))

==================
nested blocks
==================

block_1 {
  block_2 {}
  block_3 {}
}

---

(config_file
  (body
    (block
      (identifier)
      (body
        (block
          (identifier))
        (block
          (identifier))))))
