================================================================================
comment: line
================================================================================

--
-- a
--
-- a

---

(module (comment) (comment) (comment) (comment) (empty_file))

================================================================================
comment: multi
================================================================================

{- a
   a
   - a
-}
f = a
{-a-}

---

(module (comment) (function (variable) (exp_name (variable))) (comment))

================================================================================
comment: hash inside
================================================================================

{- #comment -}

---

(module (comment) (empty_file))

================================================================================
comment: newline termination
================================================================================

--

---

(module (comment) (empty_file))

================================================================================
comment: nested
================================================================================

{- comment
{- nested
-}
-}

---

(module (comment) (empty_file))

================================================================================
comment: unicode symbol
================================================================================

-- âˆ€

---

(module (comment) (empty_file))
