=================================================
scalar declaration
=================================================

my $a;

---

(source_file
  (variable_declaration (scope) (single_var_declaration
    (scalar_variable)
  ) (semi_colon))
)


=================================================
scalar declaration with initialization
=================================================

my $a = 3;

---

(source_file
  (variable_declaration (scope) (single_var_declaration
    (scalar_variable) (integer)
  ) (semi_colon))
)

=================================================
array declaration
=================================================

my @array;

---

(source_file
  (variable_declaration (scope) (single_var_declaration
    (array_variable)
  ) (semi_colon))
)

=================================================
array declaration with initialization
=================================================

my @array = ('meow', 'woof', 'burp');

---

(source_file
  (variable_declaration (scope) (single_var_declaration
    (array_variable) (array (string_single_quoted))
  ) (semi_colon))
)

=================================================
hash ref with initialization
=================================================

my $hash = {
  'cat' => 'meow',
  "cow" => 'moo',
  dog => 'woof',
};

---

(source_file
  (variable_declaration (scope) (single_var_declaration (scalar_variable)
    (hash_ref
      (identifier) (string_single_quoted)
      (identifier) (string_single_quoted)
      (identifier) (string_single_quoted)))
    (semi_colon)))

=================================================
use statement
=================================================

use Data::Dumper;

---

(source_file
  (use_statement (package_name) (semi_colon))
)

=================================================
require statement
=================================================

require Data::Dumper;

---

(source_file
  (require_statement (package_name) (semi_colon))
)

=================================================
single line comment
=================================================

# this is a single line comment

---

(source_file
  (comments)
)

=================================================
length of an array
=================================================

$#array;

---

(source_file
  (scalar_variable) (semi_colon)
)

=================================================
Double quoted string with escape sequence
=================================================

"this is a string \n in next line at the end";

---

(source_file
  (string_double_quoted (escape_sequence)) (semi_colon)
)
