================================================================================
unary
================================================================================

y(+1)

--------------------------------------------------------------------------------

(program
  (call
    (identifier)
    (arguments
      (unary_op
        (integer)))))

================================================================================
binary
================================================================================

y+1

--------------------------------------------------------------------------------

(program
  (binary_op
    (identifier)
    (integer)))

================================================================================
and expression
================================================================================

y < 1 and x > 1

--------------------------------------------------------------------------------

(program
  (binary_op
    (binary_op
      (identifier)
      (integer))
    (binary_op
      (identifier)
      (integer))))

================================================================================
bitwise shift
================================================================================

-1 <<< -2

--------------------------------------------------------------------------------

(program
  (binary_op
    (unary_op
      (integer))
    (unary_op
      (integer))))

================================================================================
bitwise or
================================================================================

a ||| b

--------------------------------------------------------------------------------

(program
  (binary_op
    (identifier)
    (identifier)))

================================================================================
bitwise expression
================================================================================

~~~2 &&& 3

--------------------------------------------------------------------------------

(program
  (binary_op
    (unary_op
      (integer))
    (integer)))

================================================================================
and on next line
================================================================================
a
&& b

--------------------------------------------------------------------------------

(program
  (binary_op
    (identifier)
    (identifier)))

================================================================================
triple dot
================================================================================

... = 144
... == !x && y || z

--------------------------------------------------------------------------------

(program
  (binary_op
    (identifier)
    (integer))
  (binary_op
    (binary_op
      (binary_op
        (identifier)
        (unary_op
          (identifier)))
      (identifier))
    (identifier)))

================================================================================
Unary operator with newline
================================================================================
-
10

--------------------------------------------------------------------------------

(program
  (unary_op
    (integer)))
