=================================================
scalar declaration
=================================================

my $a;

---

(source_file
  (variable_declaration (scope) (single_var_declaration
    (scalar_variable)
  ))
)


=================================================
scalar declaration with initialization
=================================================

my $a = 3;

---

(source_file
  (variable_declaration (scope) (single_var_declaration
    (scalar_variable) (integer)
  ))
)

=================================================
array declaration
=================================================

my @array;

---

(source_file
  (variable_declaration (scope) (single_var_declaration
    (array_variable)
  ))
)

=================================================
array declaration with initialization
=================================================

my @array = ('meow', 'woof', 'burp');

---

(source_file
  (variable_declaration (scope) (single_var_declaration
    (array_variable) (array (string_single_quoted))
  ))
)

=================================================
use statement
=================================================

use Data::Dumper;

---

(source_file
  (use_statement (package_name))
)

=================================================
require statement
=================================================

require Data::Dumper;

---

(source_file
  (require_statement (package_name))
)

=================================================
single line comment
=================================================

# this is a single line comment

---

(source_file
  (comments)
)
