==================
numeric literal scientific notation 1
==================

pi = 3

---

(config_file
  (body
    (attribute
      (identifier)
      (expression
        (expr_term
          (literal_value
            (numeric_lit)))))))

==================
numeric literal scientific notation 2
==================

pi = 3.14

---

(config_file
  (body
    (attribute
      (identifier)
      (expression
        (expr_term
          (literal_value
            (numeric_lit)))))))

==================
numeric literal scientific notation 3
==================

big_pi = 3.14e+10

---

(config_file
  (body
    (attribute
      (identifier)
      (expression
        (expr_term
          (literal_value
            (numeric_lit)))))))

==================
numeric literal scientific notation 4
==================

big_pi = 3.14E+10

---

(config_file
  (body
    (attribute
      (identifier)
      (expression
        (expr_term
          (literal_value
            (numeric_lit)))))))

==================
numeric literal scientific notation 5
==================

small_pi = 3.14e-10

---

(config_file
  (body
    (attribute
      (identifier)
      (expression
        (expr_term
          (literal_value
            (numeric_lit)))))))


==================
numeric literal scientific notation 6
==================

small_pi = 3.14E-10

---

(config_file
  (body
    (attribute
      (identifier)
      (expression
        (expr_term
          (literal_value
            (numeric_lit)))))))

==================
string literal one line
==================

foo = "bar"

---

(config_file
  (body
    (attribute
      (identifier)
      (expression
        (expr_term
          (literal_value
            (string_lit)))))))


==================
string literal multi line error
==================

foo = "
bar"

---

(config_file
  (body
    (attribute
      (identifier)
      (expression
        (expr_term
          (literal_value
            (string_lit (ERROR (UNEXPECTED 'b')))))))))

