================================================================================
family: closed, nullary
================================================================================

type family A where
  A = A

---

(module
 (type_family
  (head (type))
  (where)
  (equation
   (pattern (type))
   (type_name (type)))))

================================================================================
family: closed, tyvars
================================================================================

type family A a b c where
  A a b c = b c

---

(module
 (type_family
  (head name: (type) (type_variable) (type_variable) (type_variable))
  (where)
  (equation
   (pattern name: (type) (type_name (type_variable)) (type_name (type_variable)) (type_name (type_variable)))
   (type_apply (type_name (type_variable)) (type_name (type_variable))))))

================================================================================
family: closed, pattern matching
================================================================================

type family A a b c where
  A (Maybe a) [c] = a (Maybe c)

---

(module
 (type_family
  (head (type) (type_variable) (type_variable) (type_variable))
  (where)
  (equation
   (pattern
    (type)
    (type_parens (type_apply (type_name (type)) (type_name (type_variable))))
    (type_list (type_name (type_variable))))
   (type_apply (type_name (type_variable)) (type_parens (type_apply (type_name (type)) (type_name (type_variable))))))))

================================================================================
family: closed, signature
================================================================================

type family A a :: (k -> *) -> 'Just k where
  A a = a

---

(module
 (type_family
  (head (type) (type_variable))
  (signature
   (fun
    (type_parens (fun (type_name (type_variable)) (type_star)))
    (type_apply (type_name (promoted (type))) (type_name (type_variable)))))
(where)
  (equation
   (pattern (type) (type_name (type_variable)))
   (type_name (type_variable)))))

================================================================================
family: closed, type_variable kind
================================================================================

type family A (a :: ([k] -> *) -> k) where
  A a = a

---

(module
 (type_family
  (head
   (type)
   (annotated_type_variable
    (type_variable)
    (fun
     (type_parens (fun (type_list (type_name (type_variable))) (type_star)))
     (type_name (type_variable)))))
  (where)
  (equation (pattern (type) (type_name (type_variable))) (type_name (type_variable)))))

================================================================================
family: open
================================================================================

type family A (a :: a) :: *
type instance A [A] = A
type instance A (A A) = A

---

(module
 (type_family
  (head
   (type)
   (annotated_type_variable (type_variable) (type_name (type_variable))))
  (signature
   (type_star)))
 (type_instance
  (type_name (type))
  (type_list (type_name (type)))
  (type_name (type)))
 (type_instance
  (type_name (type))
  (type_parens
   (type_apply
    (type_name (type))
    (type_name (type))))
  (type_name (type))))

================================================================================
family: data family
================================================================================

data family A a (a :: [a]) :: Type -> *

---

(module
 (data_family
  (type)
  (type_variable)
  (annotated_type_variable (type_variable) (type_list (type_name (type_variable))))
  (fun (type_name (type)) (type_star))))

================================================================================
family: data instance adt
================================================================================

data instance âˆ€ a . A a A =
  A a A a
  |
  A { a :: A }

---

(module
 (data_instance
  (forall (type_variable))
  (type_apply
   (type_name (type))
   (type_name (type_variable))
   (type_name (type)))
  (constrs
   (data_constructor (constructor) (type_name (type_variable)) (type_name (type)) (type_name (type_variable)))
   (data_constructor_record
    (constructor)
    (record_fields (field (variable) (type_name (type))))))))

================================================================================
family: data instance gadt
================================================================================

data instance A a where
  A :: A -> A a
  deriving (A, A)

---

(module
 (data_instance
  (type_apply
   (type_name (type))
   (type_name (type_variable)))
  (where)
  (gadt_constructor
   (constructor)
   (fun (type_name (type)) (type_apply (type_name (type)) (type_name (type_variable)))))
  (deriving (type) (comma) (type))))

================================================================================
family: data instance newtype
================================================================================

newtype instance A a a = A a deriving A

---

(module
 (data_instance
  (type_apply
   (type_name (type))
   (type_name (type_variable))
   (type_name (type_variable)))
  (newtype_constructor (constructor) (type_name (type_variable)))
  (deriving (type))))
