================================================================================
incomplete behaviour attribute WIP
================================================================================

-behavior(gen

--------------------------------------------------------------------------------

  (source_file
    (ERROR
      (atom)))


================================================================================
missing dot after export attribute (limitation)
================================================================================

-export([foo/1]).
-'export'([])

--------------------------------------------------------------------------------

  (source_file
    (export_attribute
      (fa
        (atom)
        (arity
          (integer))))
    (export_attribute
      (MISSING ".")))

================================================================================
missing dot after variable (limitation)
================================================================================

  test(X) ->

--------------------------------------------------------------------------------

  (source_file
    (ERROR
      (atom)
      (expr_args
        (var))))

================================================================================
function after missing dot (limitation)
================================================================================

    foo() ->
        b
    bar() -> ok.   % ideally would be in AST

--------------------------------------------------------------------------------

    (source_file
      (fun_decl
        (function_clause
          (atom)
          (expr_args)
          (clause_body
            (atom)))
        (function_clause
          (atom)
          (expr_args)
          (clause_body
            (atom))))
      (comment))

================================================================================
function reference missing dot (limitation)
================================================================================

  foo() ->
      fun sample2:f

--------------------------------------------------------------------------------

  (source_file
    (ERROR
      (atom)
      (expr_args)
      (module
        (atom))
      (atom)))

================================================================================
incomplete record index (limitation)
================================================================================

 foo() -> #r.

--------------------------------------------------------------------------------

  (source_file
    (ERROR
      (atom)
      (expr_args)
      (record_name
        (atom))))
