==================
nonary function call
==================

foo = bar()

---

(config_file
  (body
    (attribute
      (identifier)
      (expression (expr_term (function_call (identifier)))))))

==================
unary function call
==================

foo = bar("foo")

---

(config_file
  (body
    (attribute
      (identifier)
      (expression
        (expr_term
          (function_call
            (identifier)
            (function_arguments
              (expression (expr_term (template_expr (quoted_template)))))))))))

==================
variadic function call
==================

foo = bar(x...)

---

(config_file
  (body
    (attribute
      (identifier)
      (expression
        (expr_term
          (function_call
            (identifier)
            (function_arguments
              (expression (expr_term (variable_expr (identifier)))) (ellipsis))))))))

==================
multiline function call
==================

foo = bar(
  "a",
  "b",
  "c"
)

---

(config_file
  (body
    (attribute
      (identifier)
      (expression
        (expr_term
          (function_call
            (identifier)
            (function_arguments
              (expression (expr_term (template_expr (quoted_template))))
              (expression (expr_term (template_expr (quoted_template))))
              (expression (expr_term (template_expr (quoted_template)))))))))))

