================================================================================
literal: decimal
================================================================================

a = 0
a = 100_00_532

---

(haskell
 (function
  (variable)
  (exp_literal (integer)))
 (function
  (variable)
  (exp_literal (integer))))

================================================================================
literal: octal
================================================================================

a = 0o00
a = 0O77

---

(haskell
 (function (variable) (exp_literal (integer)))
 (function (variable) (exp_literal (integer))))

================================================================================
literal: hex
================================================================================

a = 0xA8
a = 0XEF84Fe23
a = 0xa_e_123_4

---

(haskell
 (function (variable) (exp_literal (integer)))
 (function (variable) (exp_literal (integer)))
 (function (variable) (exp_literal (integer))))

================================================================================
literal: float
================================================================================

a = 0.32847283472
a = 0.00e01
a = 0.00e+01
a = 0.99E-01
a = 00e01
a = 00e+01
a = 99E-01

---

(haskell
 (function (variable) (exp_literal (float)))
 (function (variable) (exp_literal (float)))
 (function (variable) (exp_literal (float)))
 (function (variable) (exp_literal (float)))
 (function (variable) (exp_literal (float)))
 (function (variable) (exp_literal (float)))
 (function (variable) (exp_literal (float))))

================================================================================
literal: binary
================================================================================

a = 0b01110
a = 0B10010

---

(haskell
 (function (variable) (exp_literal (integer)))
 (function (variable) (exp_literal (integer))))
