================================================================================
numeric literal hex 1
================================================================================

pi = 0x314F

--------------------------------------------------------------------------------

(config_file
  (body
    (attribute
      (identifier)
      (expression
        (literal_value
          (numeric_lit))))))

================================================================================
numeric literal scientific notation 1
================================================================================

pi = 3

--------------------------------------------------------------------------------

(config_file
  (body
    (attribute
      (identifier)
      (expression
        (literal_value
          (numeric_lit))))))

================================================================================
numeric literal scientific notation 2
================================================================================

pi = 3.14

--------------------------------------------------------------------------------

(config_file
  (body
    (attribute
      (identifier)
      (expression
        (literal_value
          (numeric_lit))))))

================================================================================
numeric literal scientific notation 3
================================================================================

big_pi = 3.14e+10

--------------------------------------------------------------------------------

(config_file
  (body
    (attribute
      (identifier)
      (expression
        (literal_value
          (numeric_lit))))))

================================================================================
numeric literal scientific notation 4
================================================================================

big_pi = 3.14E+10

--------------------------------------------------------------------------------

(config_file
  (body
    (attribute
      (identifier)
      (expression
        (literal_value
          (numeric_lit))))))

================================================================================
numeric literal scientific notation 5
================================================================================

small_pi = 3.14e-10

--------------------------------------------------------------------------------

(config_file
  (body
    (attribute
      (identifier)
      (expression
        (literal_value
          (numeric_lit))))))

================================================================================
numeric literal scientific notation 6
================================================================================

small_pi = 3.14E-10

--------------------------------------------------------------------------------

(config_file
  (body
    (attribute
      (identifier)
      (expression
        (literal_value
          (numeric_lit))))))

================================================================================
bool literal true
================================================================================

foo = true

--------------------------------------------------------------------------------

(config_file
  (body
    (attribute
      (identifier)
      (expression
        (literal_value
          (bool_lit))))))

================================================================================
bool literal false
================================================================================

foo = false

--------------------------------------------------------------------------------

(config_file
  (body
    (attribute
      (identifier)
      (expression
        (literal_value
          (bool_lit))))))

================================================================================
null literal
================================================================================

foo = null

--------------------------------------------------------------------------------

(config_file
  (body
    (attribute
      (identifier)
      (expression
        (literal_value
          (null_lit))))))
