==================
numeric literal scientific notation 1
==================

pi = 3

---

(config_file
  (body
    (attribute
      (identifier)
      (expression
        (expr_term
          (literal_value
            (numeric_lit)))))))

==================
numeric literal scientific notation 2
==================

pi = 3.14

---

(config_file
  (body
    (attribute
      (identifier)
      (expression
        (expr_term
          (literal_value
            (numeric_lit)))))))

==================
numeric literal scientific notation 3
==================

big_pi = 3.14e+10

---

(config_file
  (body
    (attribute
      (identifier)
      (expression
        (expr_term
          (literal_value
            (numeric_lit)))))))

==================
numeric literal scientific notation 4
==================

big_pi = 3.14E+10

---

(config_file
  (body
    (attribute
      (identifier)
      (expression
        (expr_term
          (literal_value
            (numeric_lit)))))))

==================
numeric literal scientific notation 5
==================

small_pi = 3.14e-10

---

(config_file
  (body
    (attribute
      (identifier)
      (expression
        (expr_term
          (literal_value
            (numeric_lit)))))))


==================
numeric literal scientific notation 6
==================

small_pi = 3.14E-10

---

(config_file
  (body
    (attribute
      (identifier)
      (expression
        (expr_term
          (literal_value
            (numeric_lit)))))))

==================
bool literal true
==================

foo = true

---

(config_file
  (body
    (attribute
      (identifier)
      (expression
        (expr_term
          (literal_value
            (bool_lit)))))))

==================
bool literal false
==================

foo = false

---

(config_file
  (body
    (attribute
      (identifier)
      (expression
        (expr_term
          (literal_value
            (bool_lit)))))))

==================
null literal
==================

foo = null

---

(config_file
  (body
    (attribute
      (identifier)
      (expression
        (expr_term
          (literal_value
            (null_lit)))))))

==================
string literal one line
==================

foo = "bar"

---

(config_file
  (body
    (attribute
      (identifier)
      (expression
        (expr_term
          (literal_value
            (string_lit)))))))

==================
string literal escaped newline
==================

foo = "bar\nbaz"

---

(config_file
  (body
    (attribute
      (identifier)
      (expression (expr_term (literal_value (string_lit (escape_sequence))))))))

==================
string literal escaped tab
==================

foo = "bar\tbaz"

---

(config_file
  (body
    (attribute
      (identifier)
      (expression (expr_term (literal_value (string_lit (escape_sequence))))))))

==================
string literal escaped "
==================

foo = "bar\"baz"

---

(config_file
  (body
    (attribute
      (identifier)
      (expression (expr_term (literal_value (string_lit (escape_sequence))))))))

==================
string literal escaped \
==================

foo = "bar\\baz"

---

(config_file
  (body
    (attribute
      (identifier)
      (expression (expr_term (literal_value (string_lit (escape_sequence))))))))

==================
string literal escaped \uFFFF
==================

foo = "bar\uFFFFbaz"

---

(config_file
  (body
    (attribute
      (identifier)
      (expression (expr_term (literal_value (string_lit (escape_sequence))))))))

==================
string bad escape sequence
==================

foo = "bar\pbaz"

---

(config_file 
  (body 
    (attribute 
      (identifier) 
      (expression (expr_term (literal_value (string_lit (ERROR (UNEXPECTED 'p'))))))))) 

==================
string bad escape sequence 2
==================

foo = "bar\uZZ"

---

(config_file 
  (body 
    (attribute 
      (identifier) 
      (expression (expr_term (literal_value (string_lit (ERROR (UNEXPECTED 'Z'))))))))) 

==================
string literal multi line error
==================

foo = "
bar"

---

(config_file
  (body
    (attribute
      (identifier)
      (expression (expr_term (literal_value (string_lit (ERROR (UNEXPECTED 'b')))))))))

==================
string literal unescaped tab
==================

foo = "foo	bar"

---

(config_file
  (body
    (attribute
      (identifier)
      (expression (expr_term (literal_value (string_lit (ERROR (UNEXPECTED 'b')))))))))

