================================================================================
bad escape sequence 2
================================================================================

foo = "bar\uZZ"

--------------------------------------------------------------------------------

(config_file
  (body
    (attribute
      (identifier)
      (expression
        (template_expr
          (quoted_template
            (template_literal
              (ERROR
                (UNEXPECTED '\')))))))))

================================================================================
unescaped tab
================================================================================

foo = "foo	bar"

--------------------------------------------------------------------------------

(config_file
  (body
    (attribute
      (identifier)
      (expression
        (literal_value
          (string_lit
            (template_literal)))))))

================================================================================
unescaped backslash
================================================================================

foo = "foo\bar"

--------------------------------------------------------------------------------

(config_file
  (body
    (attribute
      (identifier)
      (expression
        (template_expr
          (quoted_template
            (template_literal
              (ERROR
                (UNEXPECTED '\')))))))))

================================================================================
escaped backslash at end
================================================================================

foo = "foo\\"

--------------------------------------------------------------------------------

(config_file
  (body
    (attribute
      (identifier)
      (expression
        (literal_value
          (string_lit
            (template_literal)))))))

================================================================================
string literal escaped template interpolation
================================================================================

foo = "$${foo.bar}"

--------------------------------------------------------------------------------

(config_file
  (body
    (attribute
      (identifier)
      (expression
        (literal_value
          (string_lit
            (template_literal)))))))

================================================================================
template chars but no template 1
================================================================================

foo = "$$$"

--------------------------------------------------------------------------------

(config_file
  (body
    (attribute
      (identifier)
      (expression
        (literal_value
          (string_lit
            (template_literal)))))))

================================================================================
template chars but no template 2
================================================================================

foo = "100%"

--------------------------------------------------------------------------------

(config_file
  (body
    (attribute
      (identifier)
      (expression
        (literal_value
          (string_lit
            (template_literal)))))))

================================================================================
template chars but no template 3
================================================================================

foo = "%\n\t"

--------------------------------------------------------------------------------

(config_file
  (body
    (attribute
      (identifier)
      (expression
        (literal_value
          (string_lit
            (template_literal)))))))

================================================================================
template chars but no template 4
================================================================================

foo = "%%\n\t"

--------------------------------------------------------------------------------

(config_file
  (body
    (attribute
      (identifier)
      (expression
        (literal_value
          (string_lit
            (template_literal)))))))

================================================================================
template chars but no template 5
================================================================================

foo = "$$"

--------------------------------------------------------------------------------

(config_file
  (body
    (attribute
      (identifier)
      (expression
        (literal_value
          (string_lit
            (template_literal)))))))

================================================================================
template chars but no template 6
================================================================================

foo = "%%{\n\t"

--------------------------------------------------------------------------------

(config_file
  (body
    (attribute
      (identifier)
      (expression
        (literal_value
          (string_lit
            (template_literal)))))))

================================================================================
escaped template
================================================================================

foo = "$${ var.bar }"

--------------------------------------------------------------------------------

(config_file
  (body
    (attribute
      (identifier)
      (expression
        (literal_value
          (string_lit
            (template_literal)))))))
