============================================
Strings
============================================

"A string with \"double\" and 'single' quotes";
'A string with "double" and \'single\' quotes';
'\\'
"\\"

----

(program
  (expression_statement (string))
  (expression_statement (string))
  (expression_statement (string))
  (expression_statement (string)))

============================================
Template strings
============================================

`one line`;
`multi
  line`;

`multi
  ${2 + 2}
  hello
  ${1 + 1,2 + 2}
  line`;

`$$$$`;
`$$$$${ 1 }`;

`\ `

`The command \`git ${args.join(' ')}\` exited with an unexpected code: ${exitCode}. The caller should either handle this error, or expect that exit code.`

----

(program
  (expression_statement (template_string (template_chars)))
  (expression_statement (template_string (template_chars)))
  (expression_statement (template_string (template_chars) (template_substitution (math_op (number) (number))) (template_chars) (template_substitution (comma_op (math_op (number) (number)) (math_op (number) (number)))) (template_chars)))
  (expression_statement (template_string (template_chars))) (expression_statement (template_string (template_chars) (template_substitution (number))))
	(expression_statement (template_string (template_chars))) (expression_statement (template_string (template_chars) (template_substitution (function_call (member_access (identifier) (identifier)) (arguments (string)))) (template_chars) (template_substitution (identifier)) (template_chars))))

============================================
Function calls with template strings
============================================

f `hello`;

---

(program
  (expression_statement (function_call (identifier) (template_string (template_chars)))))

============================================
Numbers
============================================

101;
3.14;
3.14e+1;
0x1ABCDEFabcdef;
0o7632157312;
0b1010101001;
1e+3;

---

(program
  (expression_statement (number))
  (expression_statement (number))
  (expression_statement (number))
  (expression_statement (number))
  (expression_statement (number))
  (expression_statement (number))
  (expression_statement (number)))

============================================
Variables
============================================

theVar;
theVar2;
$_;

---

(program
  (expression_statement (identifier))
  (expression_statement (identifier))
  (expression_statement (identifier)))

============================================
Booleans
============================================

this;
null;
undefined;
true;
false;

---

(program
  (expression_statement (this_expression))
  (expression_statement (null))
  (expression_statement (undefined))
  (expression_statement (true))
  (expression_statement (false)))

============================================
Regexps
============================================

/one\\/;
/one/g;
/one/i;
/one/gim;
/on\/e/gim;
/on[^/]afe/gim;

---

(program
  (expression_statement (regex))
  (expression_statement (regex))
  (expression_statement (regex))
  (expression_statement (regex))
  (expression_statement (regex))
  (expression_statement (regex)))

============================================
Objects
============================================

{};
{ a: "b" };
{ c: "d", "e": f, 1: 2 };
{
  g: h
}

---

(program
  (expression_statement (object))
  (expression_statement (object
    (pair (identifier) (string))))
  (expression_statement (object
    (pair (identifier) (string))
    (pair (string) (identifier))
    (pair (number) (number))))
  (expression_statement (object
    (pair (identifier) (identifier)))))

============================================
Objects with shorthand properties
============================================

x = {a, b, get};
y = {a,};

---

(program
  (expression_statement (assignment
    (identifier)
    (object (identifier) (identifier) (reserved_identifier))))
  (expression_statement (assignment
    (identifier)
    (object (identifier)))))

============================================
Objects with method definitions
============================================

{
  foo: true,

  add(a, b) {
    return a + b;
  },

  get bar() { return c; },

  set bar(a) { c = a; },

  *barGenerator() { yield c; },

  get() { return 1; }
};

---

(program
  (expression_statement (object
    (pair (identifier) (true))
    (method_definition
      (identifier)
      (formal_parameters (identifier) (identifier))
      (statement_block
        (return_statement (math_op (identifier) (identifier)))))
    (method_definition
      (identifier)
      (formal_parameters)
      (statement_block
        (return_statement (identifier))))
    (method_definition
      (identifier)
      (formal_parameters (identifier))
      (statement_block
        (expression_statement (assignment (identifier) (identifier)))))
    (method_definition
      (identifier)
      (formal_parameters)
      (statement_block
        (expression_statement (yield_expression (identifier)))))
    (method_definition
      (reserved_identifier)
      (formal_parameters)
      (statement_block
        (return_statement (number)))))))

============================================
Objects with reserved words for keys
============================================

{
  get: function () {},

  set: function () {},

  static: true,

  async: true
};

---

(program
  (expression_statement (object
    (pair
      (reserved_identifier)
      (function (formal_parameters) (statement_block)))
    (pair
      (reserved_identifier)
      (function (formal_parameters) (statement_block)))
    (pair (identifier) (true))
    (pair (reserved_identifier) (true)))))

============================================
Classes
============================================

class Foo {
  static one(a) { return a; };
  two(b) { return b; }
  three(c) { return c; }
}

class Foo extends require('another-class') {
  constructor() {
    super()
  }
}

---

(program
  (class
    (identifier)
    (class_body
      (method_definition
        (identifier)
        (formal_parameters (identifier))
        (statement_block (return_statement (identifier))))
      (method_definition
        (identifier)
        (formal_parameters (identifier))
        (statement_block (return_statement (identifier))))
      (method_definition
        (identifier)
        (formal_parameters (identifier))
        (statement_block (return_statement (identifier))))))

  (class
    (identifier)
    (class_heritage (function_call (identifier) (arguments (string))))
    (class_body
      (method_definition
        (identifier)
        (formal_parameters)
        (statement_block
          (expression_statement (function_call (super) (arguments))))))))

============================================
Class Property Fields
============================================

class Foo {
	static foo = 2
}

---

(program
  (class
    (identifier)
    (class_body
      (public_field_definition (identifier) (number)))))

============================================
Arrays
============================================

[];
[ "item1" ];
[ "item1", ];
[ "item1", item2 ];
[ , item2 ];
[ item2 = 5 ];

---

(program
  (expression_statement (array))
  (expression_statement (array (string)))
  (expression_statement (array (string)))
  (expression_statement (array (string) (identifier)))
  (expression_statement (array (identifier)))
  (expression_statement (array (assignment (identifier) (number)))))

============================================
Functions
============================================

[
  function() {},
  function(arg1, arg2) {
    arg2;
  },
  function stuff() {}
]

---

(program
  (expression_statement (array
    (function
      (formal_parameters)
      (statement_block))
    (function
      (formal_parameters (identifier) (identifier))
      (statement_block
        (expression_statement (identifier))))
    (function
      (identifier)
      (formal_parameters)
      (statement_block)))))

===================================================
Arrow functions
===================================================

a => 1;
() => 2;
(d, e) => 3;
(f, g) => {
  return h;
};

---

(program
  (expression_statement (arrow_function
    (identifier)
    (number)))
  (expression_statement (arrow_function
    (formal_parameters)
    (number)))
  (expression_statement (arrow_function
    (formal_parameters (identifier) (identifier))
    (number)))
  (expression_statement (arrow_function
    (formal_parameters (identifier) (identifier))
    (statement_block
      (return_statement (identifier))))))

============================================
Generator Functions
============================================

[
  function *() {},
  function *generateStuff(arg1, arg2) {
    yield;
    yield arg2;
  }
]

---

(program
  (expression_statement (array
    (generator_function
      (formal_parameters)
      (statement_block))
    (generator_function
      (identifier)
      (formal_parameters (identifier) (identifier))
      (statement_block
        (expression_statement (yield_expression))
        (expression_statement (yield_expression (identifier))))))))

============================================
Property access
============================================

x.someProperty;
x[someVariable];
x["some-string"];

---

(program
  (expression_statement (member_access (identifier) (identifier)))
  (expression_statement (subscript_access (identifier) (identifier)))
  (expression_statement (subscript_access (identifier) (string))))

============================================
Chained Property access
============================================

return returned.promise()
  .done( newDefer.resolve )
  .fail( newDefer.reject )

---

(program (return_statement
  (function_call
    (member_access
      (function_call
        (member_access
          (function_call
            (member_access (identifier) (identifier))
            (arguments))
          (identifier))
        (arguments (member_access (identifier) (identifier))))
      (identifier))
  (arguments (member_access (identifier) (identifier))))))

============================================
Chained callbacks
============================================

return this.map(function (a) {
  return a.b;
})
// a comment
.filter(function (c) {
  return c.d;
})

---


(program (return_statement
  (function_call
    (member_access
      (function_call
        (member_access (this_expression) (identifier))
        (arguments
          (function (formal_parameters (identifier)) (statement_block
            (return_statement (member_access (identifier) (identifier)))))))
        (comment)
      (identifier))
      (arguments (function (formal_parameters (identifier)) (statement_block
        (return_statement (member_access (identifier) (identifier)))))))))

============================================
Function calls
============================================

x.someMethod(arg1, "arg2");
function(x, y) {

}(a, b);

---

(program
  (expression_statement (function_call
    (member_access (identifier) (identifier))
    (arguments (identifier) (string))))
  (expression_statement (function_call
    (function
      (formal_parameters (identifier) (identifier))
      (statement_block))
    (arguments (identifier) (identifier)))))

============================================
Constructor calls
============================================

new module.Klass(1, "two");
new Thing;

---

(program
  (expression_statement (new_expression (function_call
    (member_access (identifier) (identifier))
    (arguments (number) (string)))))
  (expression_statement (new_expression
    (identifier))))

============================================
Await Expressions
============================================

await asyncFunction();
await asyncPromise;

---

(program
  (expression_statement
    (await_expression
      (function_call (identifier) (arguments))))
  (expression_statement (await_expression (identifier))))

============================================
Async Functions and Methods
============================================

async function foo() {}

{
  async bar() {
  }
}

class Foo {
  async bar() {}
}

async (a) => { return foo; };

---

(program
  (function
    (identifier)
    (formal_parameters)
    (statement_block))
  (expression_statement
    (object
      (method_definition
        (identifier)
        (formal_parameters)
        (statement_block))))
  (class (identifier) (class_body
    (method_definition
      (identifier)
      (formal_parameters)
      (statement_block))))
  (expression_statement
    (arrow_function
      (formal_parameters (identifier))
      (statement_block
        (return_statement (identifier))))))

============================================
Math operators
============================================

i++;
i--;
i + j * 3 - j % 5;
+x;
-x;

---

(program
  (expression_statement (math_op (identifier)))
  (expression_statement (math_op (identifier)))
  (expression_statement (math_op
    (math_op
      (identifier)
      (math_op (identifier) (number)))
    (math_op (identifier) (number))))
  (expression_statement (math_op (identifier)))
  (expression_statement (math_op (identifier))))

============================================
Boolean operators
============================================

i || j;
i && j;
!a && !b || !c && !d;

---

(program
  (expression_statement (bool_op (identifier) (identifier)))
  (expression_statement (bool_op (identifier) (identifier)))
  (expression_statement (bool_op
    (bool_op
      (bool_op (identifier))
      (bool_op (identifier)))
    (bool_op
      (bool_op (identifier))
      (bool_op (identifier))))))

============================================
Bitwise operators
============================================

i >> j;
i >>= j;
i >>> j;
i >>>= j;
i << j;
i <<= j;
i & j;
i | j;
~i ^ ~j

---

(program
  (expression_statement (bitwise_op (identifier) (identifier)))
  (expression_statement (bitwise_op (identifier) (identifier)))
  (expression_statement (bitwise_op (identifier) (identifier)))
  (expression_statement (bitwise_op (identifier) (identifier)))
  (expression_statement (bitwise_op (identifier) (identifier)))
  (expression_statement (bitwise_op (identifier) (identifier)))
  (expression_statement (bitwise_op (identifier) (identifier)))
  (expression_statement (bitwise_op (identifier) (identifier)))
  (expression_statement (bitwise_op
    (bitwise_op (identifier))
    (bitwise_op (identifier)))))

============================================
Relational operators
============================================

x < y;
x <= y;
x == y;
x === y;
x != y;
x !== y;
x >= y;
x > y;

---

(program
  (expression_statement (rel_op (identifier) (identifier)))
  (expression_statement (rel_op (identifier) (identifier)))
  (expression_statement (rel_op (identifier) (identifier)))
  (expression_statement (rel_op (identifier) (identifier)))
  (expression_statement (rel_op (identifier) (identifier)))
  (expression_statement (rel_op (identifier) (identifier)))
  (expression_statement (rel_op (identifier) (identifier)))
  (expression_statement (rel_op (identifier) (identifier))))

==============================================
Assignments
==============================================

x = 0;
x.y = 0;
x["y"] = 0;

---

(program
  (expression_statement (assignment
    (identifier)
    (number)))
  (expression_statement (assignment
    (member_access (identifier) (identifier))
    (number)))
  (expression_statement (assignment
    (subscript_access (identifier) (string))
    (number))))

==============================================
The comma operator
==============================================

a = 1, b = 2;
c = {d: (3, 4 + 5, 6)};

---

(program
  (expression_statement (comma_op
    (assignment (identifier) (number))
    (assignment (identifier) (number))))
  (expression_statement
    (assignment (identifier) (object
      (pair
        (identifier)
        (comma_op (number) (comma_op (math_op (number) (number)) (number))))))))

==============================================
Ternaries
==============================================

condition ? case1 : case2;

x.y = some.condition ?
  some.case :
  some.other.case;
---

(program
  (expression_statement (ternary
    (identifier) (identifier) (identifier)))
  (expression_statement (assignment
    (member_access (identifier) (identifier))
    (ternary
      (member_access (identifier) (identifier))
      (member_access (identifier) (identifier))
      (member_access (member_access (identifier) (identifier)) (identifier))))))

==============================================
Type operators
==============================================

typeof x;
x instanceof String;

---

(program
  (expression_statement (type_op (identifier)))
  (expression_statement (type_op (identifier) (identifier))))

============================================
The delete operator
============================================

delete thing['prop'];
true ? delete thing.prop : null;

---

(program
  (expression_statement
    (delete_op (subscript_access (identifier) (string))))
  (expression_statement
    (ternary (true)
      (delete_op (member_access (identifier) (identifier)))
      (null))))

============================================
The void operator
============================================

a = void b()

---

(program (expression_statement (assignment
  (identifier)
  (void_op (function_call (identifier) (arguments))))))

==============================================
Math assignment operators
==============================================

s |= 1;
t %= 2;
w ^= 3;
x += 4;
y.z *= 5;

---

(program
  (expression_statement
    (math_assignment (identifier) (number)))
  (expression_statement
    (math_assignment (identifier) (number)))
  (expression_statement
    (math_assignment (identifier) (number)))
  (expression_statement
    (math_assignment (identifier) (number)))
  (expression_statement
    (math_assignment (member_access (identifier) (identifier)) (number))))

==============================================
Operator precedence
==============================================

a <= b && c >= d;
a.b = c ? d : e;
a && b(c) && d;
a && new b(c) && d;
typeof a == b && c instanceof d

---

(program
  (expression_statement (bool_op
    (rel_op (identifier) (identifier))
    (rel_op (identifier) (identifier))))
  (expression_statement (assignment
    (member_access (identifier) (identifier))
    (ternary (identifier) (identifier) (identifier))))
  (expression_statement (bool_op
    (bool_op
      (identifier)
      (function_call (identifier) (arguments (identifier))))
    (identifier)))
  (expression_statement (bool_op
    (bool_op
      (identifier)
      (new_expression (function_call (identifier) (arguments (identifier)))))
    (identifier)))
  (expression_statement (bool_op
    (rel_op
      (type_op (identifier))
      (identifier))
    (type_op (identifier) (identifier)))))

==============================================
Simple JSX elements
==============================================

a = <div className='b' tabIndex=1 />;
b = <div>a <span>b</span> c</div>;

---

(program
  (expression_statement (assignment
    (identifier)
    (jsx_self_closing_element
      (identifier)
      (jsx_attribute (identifier) (string))
      (jsx_attribute (identifier) (number)))))
  (expression_statement (assignment
    (identifier)
    (jsx_element
      (jsx_opening_element (identifier))
      (jsx_text)
      (jsx_element
        (jsx_opening_element (identifier))
        (jsx_text)
        (jsx_closing_element (identifier)))
      (jsx_text)
      (jsx_closing_element (identifier))))))

==============================================
Expressions within JSX elements
==============================================

a = <a b c={d}> e {f} g </a>
h = <i>{...j}</i>

---

(program
  (expression_statement (assignment
    (identifier)
    (jsx_element
      (jsx_opening_element (identifier)
        (jsx_attribute (identifier))
        (jsx_attribute (identifier) (jsx_expression (identifier))))
      (jsx_text)
      (jsx_expression (identifier))
      (jsx_text)
      (jsx_closing_element (identifier)))))
  (expression_statement (assignment
    (identifier)
    (jsx_element
      (jsx_opening_element (identifier))
      (jsx_expression (spread_element (identifier)))
      (jsx_closing_element (identifier))))))


==============================================
Expressions with rest elements
==============================================

foo(...rest)

---

(program
  (expression_statement
    (function_call (identifier) (arguments (rest_argument (identifier))))))

==============================================
Math expressions
==============================================

(foo - bar) / baz

---

(program
  (expression_statement
    (math_op (math_op (identifier) (identifier)) (identifier))))


==============================================
Non-breaking spaces as whitespace
==============================================

⁠// Type definitions for Dexie v1.4.1
﻿// Project: https://github.com/dfahlander/Dexie.js
​// Definitions by: David Fahlander <http://github.com/dfahlander>
// Definitions: https://github.com/DefinitelyTyped/DefinitelyTyped

---

(program (comment) (comment) (comment) (comment))

==============================================
Yield expressions
==============================================

yield db.users.where('[endpoint+email]')

---

(program
  (expression_statement
    (yield_expression
      (function_call (member_access (member_access (identifier) (identifier)) (identifier)) (arguments (string))))))
