================
SELECT statement
================

SELECT;

---

(source_file 
    (select_statement))


=============================
SELECT statement with numbers
=============================

SELECT 1, 2;

---

(source_file 
    (select_statement
        (select_clause (number) (number))))

=============================
SELECT statement with columns
=============================

SELECT a, b;

---

(source_file 
    (select_statement
        (select_clause (identifier) (identifier))))

=============================
SELECT statement with comparison expression
=============================

SELECT 1 < 2;

---

(source_file 
    (select_statement
        (select_clause (comparison_operator (number) (number)))))

=============================
SELECT statement with is expression
=============================

SELECT a IS TRUE, b IS NOT NULL, c IS FALSE;

---

(source_file 
    (select_statement
        (select_clause 
            (is_expression (identifier) (TRUE))
            (is_expression (identifier) (NULL))
            (is_expression (identifier) (FALSE)))))

================
SELECT field
================

SELECT a.b;

---

(source_file 
    (select_statement (select_clause (identifier))))

=============================
SELECT statement with comparison expression and is expression
=============================

SELECT 1 < 2 IS TRUE;

---

(source_file 
    (select_statement
        (select_clause (is_expression (comparison_operator (number) (number)) (TRUE)))))


=====================
SELECT expression with function
=====================

SELECT foo(bar, baz) < 10;

---

(source_file 
    (select_statement
        (select_clause 
         (comparison_operator
            (function_call (identifier) (identifier) (identifier)) 
            (number)))))

=====================
SELECT expression with function without args
=====================

SELECT foo();

---

(source_file 
    (select_statement
        (select_clause 
            (function_call (identifier)))))

=====================
SELECT comparison expression boolean
=====================

SELECT TRUE AND foo(1) OR FALSE;

---

(source_file 
    (select_statement
        (select_clause 
         (boolean_expression (boolean_expression (TRUE) (function_call (identifier) (number))) (FALSE)))))

=====================
SELECT parenthesized expression
=====================

SELECT (TRUE);

---

(source_file 
    (select_statement
        (select_clause (TRUE))))


=====================
SELECT parenthesized expression 2
=====================

SELECT TRUE AND (foo(1) OR FALSE);

---

(source_file 
    (select_statement
        (select_clause 
         (boolean_expression
            (TRUE)
                (boolean_expression 
                    (function_call (identifier) (number)) (FALSE))))))

=====================
SELECT string
=====================

SELECT 'aaaa'

---

(source_file 
    (select_statement
        (select_clause (string))))


=====================
SELECT weird_string
=====================

SELECT '%{a.b}'

---

(source_file 
    (select_statement
        (select_clause (string))))


=====================
SELECT field_access
=====================

SELECT foo->>'bar'

---

(source_file 
    (select_statement
        (select_clause (field_access (identifier) (string)))))

=====================
SELECT in clause
=====================

SELECT 1 IN (1, 2);

---

(source_file 
    (select_statement
        (select_clause (in_expression (number) (tuple (number) (number))))))

=====================
CREATE TYPE statement
=====================

CREATE TYPE xest AS (data TEXT, val INT);

---

(source_file 
    (create_type_statement (identifier) 
        (parameters
            (parameter (identifier) (data_type (identifier)))
            (parameter (identifier) (data_type (identifier))))))


=====================
CREATE DOMAIN
=====================

CREATE DOMAIN test; 

---

(source_file 
    (create_domain_statement (identifier)))


=====================
CREATE DOMAIN with type
=====================

CREATE DOMAIN test AS text; 

---

(source_file 
    (create_domain_statement (identifier) (data_type (identifier))))


=====================
CREATE DOMAIN with array type
=====================

CREATE DOMAIN test_arr AS text[]; 

---

(source_file 
    (create_domain_statement (identifier) (data_type (identifier))))


=====================
CREATE DOMAIN type with constraint
=====================

CREATE DOMAIN test AS text NOT NULL; 

---

(source_file 
    (create_domain_statement (identifier) (data_type (identifier) (null_constraint (NULL)))))


=====================
CREATE DOMAIN array type with constraint
=====================

CREATE DOMAIN test AS text[] NOT NULL; 

---

(source_file 
    (create_domain_statement (identifier) (data_type (identifier) (null_constraint (NULL)))))


=====================
CREATE INDEX
=====================

CREATE INDEX test_idx ON table(col1, col2);

---

(source_file 
    (create_index_statement (identifier) (identifier)
        (index_table_parameters (identifier) (identifier))))

=====================
CREATE INDEX with function
=====================

CREATE INDEX test_idx ON table(lower(col1), col2);

---

(source_file 
    (create_index_statement (identifier) (identifier)
        (index_table_parameters (function_call (identifier) (identifier)) (identifier))))


=====================
CREATE INDEX where clause
=====================

CREATE INDEX test_idx ON table(col1) WHERE col1 IS NOT NULL;

---

(source_file 
    (create_index_statement (identifier) (identifier)
        (index_table_parameters (identifier)) (where_clause (is_expression (identifier) (NULL)))))


=====================
CREATE INDEX where clause not equal
=====================

CREATE INDEX test_idx ON table(col1) WHERE col1 <> 1

---

(source_file 
    (create_index_statement (identifier) (identifier)
        (index_table_parameters (identifier)) (where_clause (comparison_operator (identifier) (number)))))


=====================
CREATE INDEX complex
=====================

CREATE INDEX foo_idx ON table1 (col2, (lower(col1->>'attr')));

---

(source_file 
    (create_index_statement (identifier) (identifier)
        (index_table_parameters 
            (identifier)
            (function_call (identifier) (field_access (identifier) (string))))))


=====================
CREATE INDEX using 
=====================

CREATE INDEX foo_idx ON table1 USING gist (col2);

---

(source_file 
    (create_index_statement (identifier) (identifier)
        (using_clause (identifier)) (index_table_parameters (identifier))))


=====================
CREATE INDEX with order
=====================

CREATE INDEX foo_idx ON table1 (col2 DESC);

---

(source_file 
    (create_index_statement (identifier) (identifier)
        (index_table_parameters (ordered_expression (identifier)))))


=====================
CREATE TABLE
=====================

CREATE TABLE my_table (col1 INT, col2 INT)

---

(source_file 
    (create_table_statement (identifier)
        (create_table_parameters
            (create_table_column_parameter (identifier) (identifier))
            (create_table_column_parameter (identifier) (identifier)))))

=====================
CREATE TABLE with not null constraint
=====================

CREATE TABLE my_table (col1 INT NOT NULL)

---

(source_file 
    (create_table_statement (identifier)
        (create_table_parameters
            (create_table_column_parameter
                (identifier) (identifier) (null_constraint (NULL))))))

=====================
CREATE TABLE with default
=====================

CREATE TABLE my_table (col1 INT DEFAULT get_num())

---

(source_file 
    (create_table_statement (identifier)
        (create_table_parameters
            (create_table_column_parameter
                (identifier)
                (identifier)
                (function_call (identifier))))))

=====================
CREATE TABLE with primary key constraint
=====================

CREATE TABLE my_table (col1 INT PRIMARY KEY)

---

(source_file 
    (create_table_statement (identifier)
        (create_table_parameters
            (create_table_column_parameter
                (identifier)
                (identifier)
                (primary_key_constraint)))))

=====================
CREATE TABLE with references constraint
=====================

CREATE TABLE my_table (col1 INT REFERENCES table1)

---

(source_file 
    (create_table_statement (identifier)
        (create_table_parameters
            (create_table_column_parameter
                (identifier)
                (identifier)
                (references_constraint (identifier))))))

=====================
CREATE TABLE with references constraint with column specified
=====================

CREATE TABLE my_table (col1 INT REFERENCES table1(col1))

---

(source_file 
    (create_table_statement (identifier)
        (create_table_parameters
            (create_table_column_parameter
                (identifier)
                (identifier)
                (references_constraint (identifier) (identifier))))))

=====================
CREATE TABLE with references constraint with actions
=====================

CREATE TABLE my_table (col1 INT REFERENCES table1(col1) ON DELETE SET NULL ON UPDATE RESTRICT)

---

(source_file 
    (create_table_statement (identifier)
        (create_table_parameters
            (create_table_column_parameter
                (identifier)
                (identifier)
                (references_constraint (identifier) (identifier) (on_delete_action) (on_update_action))))))
