================================================================================
nonary function call
================================================================================

foo = bar()

--------------------------------------------------------------------------------

(config_file
  (body
    (attribute
      (identifier)
      (expression
        (function_call
          (identifier))))))

================================================================================
unary function call
================================================================================

foo = bar("foo")

--------------------------------------------------------------------------------

(config_file
  (body
    (attribute
      (identifier)
      (expression
        (function_call
          (identifier)
          (function_arguments
            (expression
              (literal_value
                (string_lit
                  (quoted_template_start)
                  (template_literal)
                  (quoted_template_end))))))))))

================================================================================
variadic function call
================================================================================

foo = bar(x...)

--------------------------------------------------------------------------------

(config_file
  (body
    (attribute
      (identifier)
      (expression
        (function_call
          (identifier)
          (function_arguments
            (expression
              (variable_expr
                (identifier)))
            (ellipsis)))))))

================================================================================
multiline function call
================================================================================

foo = bar(
  "a",
  "b",
  "c"
)

--------------------------------------------------------------------------------

(config_file
  (body
    (attribute
      (identifier)
      (expression
        (function_call
          (identifier)
          (function_arguments
            (expression
              (literal_value
                (string_lit
                  (quoted_template_start)
                  (template_literal)
                  (quoted_template_end))))
            (expression
              (literal_value
                (string_lit
                  (quoted_template_start)
                  (template_literal)
                  (quoted_template_end))))
            (expression
              (literal_value
                (string_lit
                  (quoted_template_start)
                  (template_literal)
                  (quoted_template_end))))))))))
