======================
should parse literal 0
======================

0

---

(document
  (number))

======================
should parse literal 1
======================

1

---

(document
  (number))

=========================
should parse literal 3.14
=========================

3.14

---

(document
  (number))

============================
should parse literal 1.23e10
============================

1.23e10

---

(document
  (number))
