================================================================================
Example 1 - https://github.github.com/gfm/#example-1
================================================================================
	foo	baz		bim

--------------------------------------------------------------------------------

(document
  (section
    (indented_code_block)))

================================================================================
Example 2 - https://github.github.com/gfm/#example-2
================================================================================
  	foo	baz		bim

--------------------------------------------------------------------------------

(document
  (section
    (indented_code_block)))

================================================================================
Example 3 - https://github.github.com/gfm/#example-3
================================================================================
    a	a
    ὐ	a

--------------------------------------------------------------------------------

(document
  (section
    (indented_code_block
      (block_continuation))))

================================================================================
Example 4 - https://github.github.com/gfm/#example-4
================================================================================
  - foo

	bar

--------------------------------------------------------------------------------

(document
  (section
    (list
      (list_item
        (list_marker_minus)
        (paragraph
          (inline)
          (block_continuation))
        (block_continuation)
        (paragraph
          (inline))))))

================================================================================
Example 5 - https://github.github.com/gfm/#example-5
================================================================================
- foo

		bar

--------------------------------------------------------------------------------

(document
  (section
    (list
      (list_item
        (list_marker_minus)
        (paragraph
          (inline)
          (block_continuation))
        (block_continuation)
        (indented_code_block)))))

================================================================================
Example 6 - https://github.github.com/gfm/#example-6
================================================================================
>		foo

--------------------------------------------------------------------------------

(document
  (section
    (block_quote
      (block_quote_marker)
      (indented_code_block))))

================================================================================
Example 7 - https://github.github.com/gfm/#example-7
================================================================================
-		foo

--------------------------------------------------------------------------------

(document
  (section
    (list
      (list_item
        (list_marker_minus)
        (indented_code_block)))))

================================================================================
Example 8 - https://github.github.com/gfm/#example-8
================================================================================
    foo
	bar

--------------------------------------------------------------------------------

(document
  (section
    (indented_code_block
      (block_continuation))))

================================================================================
Example 9 - https://github.github.com/gfm/#example-9
================================================================================
 - foo
   - bar
	 - baz

--------------------------------------------------------------------------------

(document
  (section
    (list
      (list_item
        (list_marker_minus)
        (paragraph
          (inline)
          (block_continuation))
        (list
          (list_item
            (list_marker_minus)
            (paragraph
              (inline)
              (block_continuation))
            (list
              (list_item
                (list_marker_minus)
                (paragraph
                  (inline))))))))))

================================================================================
Example 10 - https://github.github.com/gfm/#example-10
================================================================================
#	Foo

--------------------------------------------------------------------------------

(document
  (section
    (atx_heading
      (atx_h1_marker)
      (inline))))

================================================================================
Example 11 - https://github.github.com/gfm/#example-11
================================================================================
*	*	*

--------------------------------------------------------------------------------

(document
  (section
    (thematic_break)))

================================================================================
Example 12 - https://github.github.com/gfm/#example-12
================================================================================
- `one
- two`

--------------------------------------------------------------------------------

(document
  (section
    (list
      (list_item
        (list_marker_minus)
        (paragraph
          (inline)))
      (list_item
        (list_marker_minus)
        (paragraph
          (inline))))))

================================================================================
Example 13 - https://github.github.com/gfm/#example-13
================================================================================
***
---
___

--------------------------------------------------------------------------------

(document
  (section
    (thematic_break)
    (thematic_break)
    (thematic_break)))

================================================================================
Example 14 - https://github.github.com/gfm/#example-14
================================================================================
+++

--------------------------------------------------------------------------------

(document
  (section
    (paragraph
      (inline))))

================================================================================
Example 15 - https://github.github.com/gfm/#example-15
================================================================================
=

--------------------------------------------------------------------------------

(document
  (section
    (paragraph
      (inline))))

================================================================================
Example 16 - https://github.github.com/gfm/#example-16
================================================================================
--
**
__

--------------------------------------------------------------------------------

(document
  (section
    (paragraph
      (inline))))

================================================================================
Example 17 - https://github.github.com/gfm/#example-17
================================================================================
 ***
  ***
   ***

--------------------------------------------------------------------------------

(document
  (section
    (thematic_break)
    (thematic_break)
    (thematic_break)))

================================================================================
Example 18 - https://github.github.com/gfm/#example-18
================================================================================
    ***

--------------------------------------------------------------------------------

(document
  (section
    (indented_code_block)))

================================================================================
Example 19 - https://github.github.com/gfm/#example-19
================================================================================
Foo
    ***

--------------------------------------------------------------------------------

(document
  (section
    (paragraph
      (inline))))

================================================================================
Example 20 - https://github.github.com/gfm/#example-20
================================================================================
_____________________________________

--------------------------------------------------------------------------------

(document
  (section
    (thematic_break)))

================================================================================
Example 21 - https://github.github.com/gfm/#example-21
================================================================================
 - - -

--------------------------------------------------------------------------------

(document
  (section
    (thematic_break)))

================================================================================
Example 22 - https://github.github.com/gfm/#example-22
================================================================================
 **  * ** * ** * **

--------------------------------------------------------------------------------

(document
  (section
    (thematic_break)))

================================================================================
Example 23 - https://github.github.com/gfm/#example-23
================================================================================
-     -      -      -

--------------------------------------------------------------------------------

(document
  (section
    (thematic_break)))

================================================================================
Example 24 - https://github.github.com/gfm/#example-24
================================================================================
- - - -

--------------------------------------------------------------------------------

(document
  (section
    (thematic_break)))

================================================================================
Example 25 - https://github.github.com/gfm/#example-25
================================================================================
_ _ _ _ a

a------

---a---

--------------------------------------------------------------------------------

(document
  (section
    (paragraph
      (inline))
    (paragraph
      (inline))
    (paragraph
      (inline))))

================================================================================
Example 26 - https://github.github.com/gfm/#example-26
================================================================================
 *-*

--------------------------------------------------------------------------------

(document
  (section
    (paragraph
      (inline))))

================================================================================
Example 27 - https://github.github.com/gfm/#example-27
================================================================================
- foo
***
- bar

--------------------------------------------------------------------------------

(document
  (section
    (list
      (list_item
        (list_marker_minus)
        (paragraph
          (inline))))
    (thematic_break)
    (list
      (list_item
        (list_marker_minus)
        (paragraph
          (inline))))))

================================================================================
Example 28 - https://github.github.com/gfm/#example-28
================================================================================
Foo
***
bar

--------------------------------------------------------------------------------

(document
  (section
    (paragraph
      (inline))
    (thematic_break)
    (paragraph
      (inline))))

================================================================================
Example 29 - https://github.github.com/gfm/#example-29
================================================================================
Foo
---
bar

--------------------------------------------------------------------------------

(document
  (section
    (setext_heading
      (paragraph
        (inline))
      (setext_h2_underline))
    (paragraph
      (inline))))

================================================================================
Example 30 - https://github.github.com/gfm/#example-30
================================================================================
* Foo
* * *
* Bar

--------------------------------------------------------------------------------

(document
  (section
    (list
      (list_item
        (list_marker_star)
        (paragraph
          (inline))))
    (thematic_break)
    (list
      (list_item
        (list_marker_star)
        (paragraph
          (inline))))))

================================================================================
Example 31 - https://github.github.com/gfm/#example-31
================================================================================
- Foo
- * * *

--------------------------------------------------------------------------------

(document
  (section
    (list
      (list_item
        (list_marker_minus)
        (paragraph
          (inline)))
      (list_item
        (list_marker_minus)
        (thematic_break)))))

================================================================================
Example 32 - https://github.github.com/gfm/#example-32
================================================================================
# foo
## foo
### foo
#### foo
##### foo
###### foo

--------------------------------------------------------------------------------

(document
  (section
    (atx_heading
      (atx_h1_marker)
      (inline))
    (section
      (atx_heading
        (atx_h2_marker)
        (inline))
      (section
        (atx_heading
          (atx_h3_marker)
          (inline))
        (section
          (atx_heading
            (atx_h4_marker)
            (inline))
          (section
            (atx_heading
              (atx_h5_marker)
              (inline))
            (section
              (atx_heading
                (atx_h6_marker)
                (inline)))))))))

================================================================================
Example 33 - https://github.github.com/gfm/#example-33
================================================================================
####### foo

--------------------------------------------------------------------------------

(document
  (section
    (paragraph
      (inline))))

================================================================================
Example 34 - https://github.github.com/gfm/#example-34
================================================================================
#5 bolt

#hashtag

--------------------------------------------------------------------------------

(document
  (section
    (paragraph
      (inline))
    (paragraph
      (inline))))

================================================================================
Example 35 - https://github.github.com/gfm/#example-35
================================================================================
\## foo

--------------------------------------------------------------------------------

(document
  (section
    (paragraph
      (inline))))

================================================================================
Example 36 - https://github.github.com/gfm/#example-36
================================================================================
# foo *bar* \*baz\*

--------------------------------------------------------------------------------

(document
  (section
    (atx_heading
      (atx_h1_marker)
      (inline))))

================================================================================
Example 37 - https://github.github.com/gfm/#example-37
================================================================================
#                  foo

--------------------------------------------------------------------------------

(document
  (section
    (atx_heading
      (atx_h1_marker)
      (inline))))

================================================================================
Example 38 - https://github.github.com/gfm/#example-38
================================================================================
 ### foo
  ## foo
   # foo

--------------------------------------------------------------------------------

(document
  (section
    (atx_heading
      (atx_h3_marker)
      (inline)))
  (section
    (atx_heading
      (atx_h2_marker)
      (inline)))
  (section
    (atx_heading
      (atx_h1_marker)
      (inline))))

================================================================================
Example 39 - https://github.github.com/gfm/#example-39
================================================================================
    # foo

--------------------------------------------------------------------------------

(document
  (section
    (indented_code_block)))

================================================================================
Example 40 - https://github.github.com/gfm/#example-40
================================================================================
foo
    # bar

--------------------------------------------------------------------------------

(document
  (section
    (paragraph
      (inline))))

================================================================================
Example 41 - https://github.github.com/gfm/#example-41
================================================================================
## foo ##
  ###   bar    ###

--------------------------------------------------------------------------------

(document
  (section
    (atx_heading
      (atx_h2_marker)
      (inline))
    (section
      (atx_heading
        (atx_h3_marker)
        (inline)))))

================================================================================
Example 42 - https://github.github.com/gfm/#example-42
================================================================================
# foo ##################################
##### foo ##

--------------------------------------------------------------------------------

(document
  (section
    (atx_heading
      (atx_h1_marker)
      (inline))
    (section
      (atx_heading
        (atx_h5_marker)
        (inline)))))

================================================================================
Example 43 - https://github.github.com/gfm/#example-43
================================================================================
### foo ###

--------------------------------------------------------------------------------

(document
  (section
    (atx_heading
      (atx_h3_marker)
      (inline))))

================================================================================
Example 44 - https://github.github.com/gfm/#example-44
================================================================================
### foo ### b

--------------------------------------------------------------------------------

(document
  (section
    (atx_heading
      (atx_h3_marker)
      (inline))))

================================================================================
Example 45 - https://github.github.com/gfm/#example-45
================================================================================
# foo#

--------------------------------------------------------------------------------

(document
  (section
    (atx_heading
      (atx_h1_marker)
      (inline))))

================================================================================
Example 46 - https://github.github.com/gfm/#example-46
================================================================================
### foo \###
## foo #\##
# foo \#

--------------------------------------------------------------------------------

(document
  (section
    (atx_heading
      (atx_h3_marker)
      (inline)))
  (section
    (atx_heading
      (atx_h2_marker)
      (inline)))
  (section
    (atx_heading
      (atx_h1_marker)
      (inline))))

================================================================================
Example 47 - https://github.github.com/gfm/#example-47
================================================================================
****
## foo
****

--------------------------------------------------------------------------------

(document
  (section
    (thematic_break))
  (section
    (atx_heading
      (atx_h2_marker)
      (inline))
    (thematic_break)))

================================================================================
Example 48 - https://github.github.com/gfm/#example-48
================================================================================
Foo bar
# baz
Bar foo

--------------------------------------------------------------------------------

(document
  (section
    (paragraph
      (inline)))
  (section
    (atx_heading
      (atx_h1_marker)
      (inline))
    (paragraph
      (inline))))

================================================================================
Example 49 - https://github.github.com/gfm/#example-49
================================================================================
##
#
### ###

--------------------------------------------------------------------------------

(document
  (section
    (atx_heading
      (atx_h2_marker)))
  (section
    (atx_heading
      (atx_h1_marker))
    (section
      (atx_heading
        (atx_h3_marker)
        (inline)))))

================================================================================
Example 50 - https://github.github.com/gfm/#example-50
================================================================================
Foo *bar*
=

Foo *bar*
---------

--------------------------------------------------------------------------------

(document
  (section
    (setext_heading
      (paragraph
        (inline))
      (setext_h1_underline))
    (section
      (setext_heading
        (paragraph
          (inline))
        (setext_h2_underline)))))

================================================================================
Example 51 - https://github.github.com/gfm/#example-51
================================================================================
Foo *bar
baz*
=

--------------------------------------------------------------------------------

(document
  (section
    (setext_heading
      (paragraph
        (inline))
      (setext_h1_underline))))

================================================================================
Example 52 - https://github.github.com/gfm/#example-52
================================================================================
  Foo *bar
baz*
=

--------------------------------------------------------------------------------

(document
  (section
    (setext_heading
      (paragraph
        (inline))
      (setext_h1_underline))))

================================================================================
Example 53 - https://github.github.com/gfm/#example-53
================================================================================
Foo
-------------------------

Foo
=

--------------------------------------------------------------------------------

(document
  (section
    (setext_heading
      (paragraph
        (inline))
      (setext_h2_underline))
    (paragraph
      (inline))
    (paragraph
      (inline))))

================================================================================
Example 54 - https://github.github.com/gfm/#example-54
================================================================================
   Foo
---

  Foo
-----

  Foo
  ===

--------------------------------------------------------------------------------

(document
  (section
    (setext_heading
      (paragraph
        (inline))
      (setext_h2_underline))
    (paragraph
      (inline))
    (thematic_break)
    (paragraph
      (inline))
    (paragraph
      (inline))))

================================================================================
Example 55 - https://github.github.com/gfm/#example-55
================================================================================
    Foo
    ---

    Foo
---

--------------------------------------------------------------------------------

(document
  (section
    (indented_code_block
      (block_continuation))
    (thematic_break)))

================================================================================
Example 56 - https://github.github.com/gfm/#example-56
================================================================================
Foo
   ----

--------------------------------------------------------------------------------

(document
  (section
    (setext_heading
      (paragraph
        (inline))
      (setext_h2_underline))))

================================================================================
Example 57 - https://github.github.com/gfm/#example-57
================================================================================
Foo
    ---

--------------------------------------------------------------------------------

(document
  (section
    (paragraph
      (inline))))

================================================================================
Example 58 - https://github.github.com/gfm/#example-58
================================================================================
Foo
= =

Foo
--- -

--------------------------------------------------------------------------------

(document
  (section
    (paragraph
      (inline))
    (paragraph
      (inline))
    (thematic_break)))

================================================================================
Example 59 - https://github.github.com/gfm/#example-59
================================================================================
Foo
-----

--------------------------------------------------------------------------------

(document
  (section
    (setext_heading
      (paragraph
        (inline))
      (setext_h2_underline))))

================================================================================
Example 60 - https://github.github.com/gfm/#example-60
================================================================================
Foo\
----

--------------------------------------------------------------------------------

(document
  (section
    (setext_heading
      (paragraph
        (inline))
      (setext_h2_underline))))

================================================================================
Example 61 - https://github.github.com/gfm/#example-61
================================================================================
`Foo
----
`

<a title="a lot
---
of dashes"/>

--------------------------------------------------------------------------------

(document
  (section
    (setext_heading
      (paragraph
        (inline))
      (setext_h2_underline))
    (paragraph
      (inline))
    (paragraph
      (inline))
    (thematic_break)
    (paragraph
      (inline))))

================================================================================
Example 62 - https://github.github.com/gfm/#example-62
================================================================================
> Foo
---

--------------------------------------------------------------------------------

(document
  (section
    (block_quote
      (block_quote_marker)
      (paragraph
        (inline)))
    (thematic_break)))

================================================================================
Example 63 - https://github.github.com/gfm/#example-63
================================================================================
> foo
bar
=

--------------------------------------------------------------------------------

(document
  (section
    (block_quote
      (block_quote_marker)
      (paragraph
        (inline)))))

================================================================================
Example 64 - https://github.github.com/gfm/#example-64
================================================================================
- Foo
---

--------------------------------------------------------------------------------

(document
  (section
    (list
      (list_item
        (list_marker_minus)
        (paragraph
          (inline))))
    (thematic_break)))

================================================================================
Example 65 - https://github.github.com/gfm/#example-65
================================================================================
Foo
Bar
---

--------------------------------------------------------------------------------

(document
  (section
    (setext_heading
      (paragraph
        (inline))
      (setext_h2_underline))))

================================================================================
Example 66 - https://github.github.com/gfm/#example-66
================================================================================
Extra text so this is not parsed as metadata.

---
Foo
---
Bar
---
Baz

--------------------------------------------------------------------------------

(document
  (section
    (paragraph
      (inline))
    (thematic_break))
  (section
    (setext_heading
      (paragraph
        (inline))
      (setext_h2_underline))
    (paragraph
      (inline))
    (thematic_break)
    (paragraph
      (inline))))

================================================================================
Example 67 - https://github.github.com/gfm/#example-67
================================================================================

=

--------------------------------------------------------------------------------

(document
  (section
    (paragraph
      (inline))))

================================================================================
Example 68 - https://github.github.com/gfm/#example-68
================================================================================
Extra text so this is not parsed as metadata.

---
---

--------------------------------------------------------------------------------

(document
  (section
    (paragraph
      (inline))
    (thematic_break)
    (thematic_break)))

================================================================================
Example 69 - https://github.github.com/gfm/#example-69
================================================================================
- foo
-----

--------------------------------------------------------------------------------

(document
  (section
    (list
      (list_item
        (list_marker_minus)
        (paragraph
          (inline))))
    (thematic_break)))

================================================================================
Example 70 - https://github.github.com/gfm/#example-70
================================================================================
    foo
---

--------------------------------------------------------------------------------

(document
  (section
    (indented_code_block)
    (thematic_break)))

================================================================================
Example 71 - https://github.github.com/gfm/#example-71
================================================================================
> foo
-----

--------------------------------------------------------------------------------

(document
  (section
    (block_quote
      (block_quote_marker)
      (paragraph
        (inline)))
    (thematic_break)))

================================================================================
Example 72 - https://github.github.com/gfm/#example-72
================================================================================
\> foo
------

--------------------------------------------------------------------------------

(document
  (section
    (setext_heading
      (paragraph
        (inline))
      (setext_h2_underline))))

================================================================================
Example 73 - https://github.github.com/gfm/#example-73
================================================================================
Foo

bar
---
baz

--------------------------------------------------------------------------------

(document
  (section
    (paragraph
      (inline)))
  (section
    (setext_heading
      (paragraph
        (inline))
      (setext_h2_underline))
    (paragraph
      (inline))))

================================================================================
Example 74 - https://github.github.com/gfm/#example-74
================================================================================
Foo
bar

---

baz

--------------------------------------------------------------------------------

(document
  (section
    (paragraph
      (inline))
    (thematic_break)
    (paragraph
      (inline))))

================================================================================
Example 75 - https://github.github.com/gfm/#example-75
================================================================================
Foo
bar
* * *
baz

--------------------------------------------------------------------------------

(document
  (section
    (paragraph
      (inline))
    (thematic_break)
    (paragraph
      (inline))))

================================================================================
Example 76 - https://github.github.com/gfm/#example-76
================================================================================
Foo
bar
\---
baz

--------------------------------------------------------------------------------

(document
  (section
    (paragraph
      (inline))))

================================================================================
Example 77 - https://github.github.com/gfm/#example-77
================================================================================
    a simple
      indented code block

--------------------------------------------------------------------------------

(document
  (section
    (indented_code_block
      (block_continuation))))

================================================================================
Example 78 - https://github.github.com/gfm/#example-78
================================================================================
  - foo

    bar

--------------------------------------------------------------------------------

(document
  (section
    (list
      (list_item
        (list_marker_minus)
        (paragraph
          (inline)
          (block_continuation))
        (block_continuation)
        (paragraph
          (inline))))))

================================================================================
Example 79 - https://github.github.com/gfm/#example-79
================================================================================
1.  foo

    - bar

--------------------------------------------------------------------------------

(document
  (section
    (list
      (list_item
        (list_marker_dot)
        (paragraph
          (inline)
          (block_continuation))
        (block_continuation)
        (list
          (list_item
            (list_marker_minus)
            (paragraph
              (inline))))))))

================================================================================
Example 80 - https://github.github.com/gfm/#example-80
================================================================================
    <a/>
    *hi*

    - one

--------------------------------------------------------------------------------

(document
  (section
    (indented_code_block
      (block_continuation))))

================================================================================
Example 81 - https://github.github.com/gfm/#example-81
================================================================================
    chunk1

    chunk2



    chunk3

--------------------------------------------------------------------------------

(document
  (section
    (indented_code_block)))

================================================================================
Example 82 - https://github.github.com/gfm/#example-82
================================================================================
    chunk1

      chunk2

--------------------------------------------------------------------------------

(document
  (section
    (indented_code_block)))

================================================================================
Example 83 - https://github.github.com/gfm/#example-83
================================================================================
Foo
    bar


--------------------------------------------------------------------------------

(document
  (section
    (paragraph
      (inline))))

================================================================================
Example 84 - https://github.github.com/gfm/#example-84
================================================================================
    foo
bar

--------------------------------------------------------------------------------

(document
  (section
    (indented_code_block)
    (paragraph
      (inline))))

================================================================================
Example 85 - https://github.github.com/gfm/#example-85
================================================================================
# Heading
    foo
Heading
------
    foo
----

--------------------------------------------------------------------------------

(document
  (section
    (atx_heading
      (atx_h1_marker)
      (inline))
    (indented_code_block)
    (section
      (setext_heading
        (paragraph
          (inline))
        (setext_h2_underline))
      (indented_code_block)
      (thematic_break))))

================================================================================
Example 86 - https://github.github.com/gfm/#example-86
================================================================================
        foo
    bar

--------------------------------------------------------------------------------

(document
  (section
    (indented_code_block
      (block_continuation))))

================================================================================
Example 87 - https://github.github.com/gfm/#example-87
================================================================================


    foo



--------------------------------------------------------------------------------

(document
  (section
    (indented_code_block)))

================================================================================
Example 88 - https://github.github.com/gfm/#example-88
================================================================================
    foo

--------------------------------------------------------------------------------

(document
  (section
    (indented_code_block)))

================================================================================
Example 89 - https://github.github.com/gfm/#example-89
================================================================================
```
<
 >
```

--------------------------------------------------------------------------------

(document
  (section
    (fenced_code_block
      (fenced_code_block_delimiter)
      (block_continuation)
      (code_fence_content
        (block_continuation)
        (block_continuation))
      (fenced_code_block_delimiter))))

================================================================================
Example 90 - https://github.github.com/gfm/#example-90
================================================================================
~~~
<
 >
~~~

--------------------------------------------------------------------------------

(document
  (section
    (fenced_code_block
      (fenced_code_block_delimiter)
      (block_continuation)
      (code_fence_content
        (block_continuation)
        (block_continuation))
      (fenced_code_block_delimiter))))

================================================================================
Example 91 - https://github.github.com/gfm/#example-91
================================================================================
``
foo
``

--------------------------------------------------------------------------------

(document
  (section
    (paragraph
      (inline))))

================================================================================
Example 92 - https://github.github.com/gfm/#example-92
================================================================================
```
aaa
~~~
```

--------------------------------------------------------------------------------

(document
  (section
    (fenced_code_block
      (fenced_code_block_delimiter)
      (block_continuation)
      (code_fence_content
        (block_continuation)
        (block_continuation))
      (fenced_code_block_delimiter))))

================================================================================
Example 93 - https://github.github.com/gfm/#example-93
================================================================================
~~~
aaa
```
~~~

--------------------------------------------------------------------------------

(document
  (section
    (fenced_code_block
      (fenced_code_block_delimiter)
      (block_continuation)
      (code_fence_content
        (block_continuation)
        (block_continuation))
      (fenced_code_block_delimiter))))

================================================================================
Example 94 - https://github.github.com/gfm/#example-94
================================================================================
````
aaa
```
``````

--------------------------------------------------------------------------------

(document
  (section
    (fenced_code_block
      (fenced_code_block_delimiter)
      (block_continuation)
      (code_fence_content
        (block_continuation)
        (block_continuation))
      (fenced_code_block_delimiter))))

================================================================================
Example 95 - https://github.github.com/gfm/#example-95
================================================================================
~~~~
aaa
~~~
~~~~

--------------------------------------------------------------------------------

(document
  (section
    (fenced_code_block
      (fenced_code_block_delimiter)
      (block_continuation)
      (code_fence_content
        (block_continuation)
        (block_continuation))
      (fenced_code_block_delimiter))))

================================================================================
Example 96 - https://github.github.com/gfm/#example-96
================================================================================
```

--------------------------------------------------------------------------------

(document
  (section
    (fenced_code_block
      (fenced_code_block_delimiter))))

================================================================================
Example 97 - https://github.github.com/gfm/#example-97
================================================================================
`````

```
aaa

--------------------------------------------------------------------------------

(document
  (section
    (fenced_code_block
      (fenced_code_block_delimiter)
      (block_continuation)
      (code_fence_content
        (block_continuation)
        (block_continuation)))))

================================================================================
Example 98 - https://github.github.com/gfm/#example-98
================================================================================
> ```
> aaa

bbb

--------------------------------------------------------------------------------

(document
  (section
    (block_quote
      (block_quote_marker)
      (fenced_code_block
        (fenced_code_block_delimiter)
        (block_continuation)
        (code_fence_content)))
    (paragraph
      (inline))))

================================================================================
Example 99 - https://github.github.com/gfm/#example-99
================================================================================
```


```

--------------------------------------------------------------------------------

(document
  (section
    (fenced_code_block
      (fenced_code_block_delimiter)
      (block_continuation)
      (code_fence_content
        (block_continuation)
        (block_continuation))
      (fenced_code_block_delimiter))))

================================================================================
Example 100 - https://github.github.com/gfm/#example-100
================================================================================
```
```

--------------------------------------------------------------------------------

(document
  (section
    (fenced_code_block
      (fenced_code_block_delimiter)
      (block_continuation)
      (fenced_code_block_delimiter))))

================================================================================
Example 101 - https://github.github.com/gfm/#example-101
================================================================================
 ```
 aaa
aaa
```

--------------------------------------------------------------------------------

(document
  (section
    (fenced_code_block
      (fenced_code_block_delimiter)
      (block_continuation)
      (code_fence_content
        (block_continuation)
        (block_continuation))
      (fenced_code_block_delimiter))))

================================================================================
Example 102 - https://github.github.com/gfm/#example-102
================================================================================
  ```
aaa
  aaa
aaa
  ```

--------------------------------------------------------------------------------

(document
  (section
    (fenced_code_block
      (fenced_code_block_delimiter)
      (block_continuation)
      (code_fence_content
        (block_continuation)
        (block_continuation)
        (block_continuation))
      (fenced_code_block_delimiter))))

================================================================================
Example 103 - https://github.github.com/gfm/#example-103
================================================================================
   ```
   aaa
    aaa
  aaa
   ```

--------------------------------------------------------------------------------

(document
  (section
    (fenced_code_block
      (fenced_code_block_delimiter)
      (block_continuation)
      (code_fence_content
        (block_continuation)
        (block_continuation)
        (block_continuation))
      (fenced_code_block_delimiter))))

================================================================================
Example 104 - https://github.github.com/gfm/#example-104
================================================================================
    ```
    aaa
    ```

--------------------------------------------------------------------------------

(document
  (section
    (indented_code_block
      (block_continuation)
      (block_continuation))))

================================================================================
Example 105 - https://github.github.com/gfm/#example-105
================================================================================
```
aaa
  ```

--------------------------------------------------------------------------------

(document
  (section
    (fenced_code_block
      (fenced_code_block_delimiter)
      (block_continuation)
      (code_fence_content
        (block_continuation))
      (fenced_code_block_delimiter))))

================================================================================
Example 106 - https://github.github.com/gfm/#example-106
================================================================================
   ```
aaa
  ```

--------------------------------------------------------------------------------

(document
  (section
    (fenced_code_block
      (fenced_code_block_delimiter)
      (block_continuation)
      (code_fence_content
        (block_continuation))
      (fenced_code_block_delimiter))))

================================================================================
Example 108 - https://github.github.com/gfm/#example-108
================================================================================
``` ```
aaa

--------------------------------------------------------------------------------

(document
  (section
    (paragraph
      (inline))))

================================================================================
Example 109 - https://github.github.com/gfm/#example-109
================================================================================
~~~~~~
aaa
~~~ ~~

--------------------------------------------------------------------------------

(document
  (section
    (fenced_code_block
      (fenced_code_block_delimiter)
      (block_continuation)
      (code_fence_content
        (block_continuation)))))

================================================================================
Example 110 - https://github.github.com/gfm/#example-110
================================================================================
foo
```
bar
```
baz

--------------------------------------------------------------------------------

(document
  (section
    (paragraph
      (inline))
    (fenced_code_block
      (fenced_code_block_delimiter)
      (block_continuation)
      (code_fence_content
        (block_continuation))
      (fenced_code_block_delimiter))
    (paragraph
      (inline))))

================================================================================
Example 111 - https://github.github.com/gfm/#example-111
================================================================================
foo
---
~~~
bar
~~~
# baz

--------------------------------------------------------------------------------

(document
  (section
    (setext_heading
      (paragraph
        (inline))
      (setext_h2_underline))
    (fenced_code_block
      (fenced_code_block_delimiter)
      (block_continuation)
      (code_fence_content
        (block_continuation))
      (fenced_code_block_delimiter)))
  (section
    (atx_heading
      (atx_h1_marker)
      (inline))))

================================================================================
Example 112 - https://github.github.com/gfm/#example-112
================================================================================
```ruby
def foo(x)
  return 3
end
```

--------------------------------------------------------------------------------

(document
  (section
    (fenced_code_block
      (fenced_code_block_delimiter)
      (info_string
        (language))
      (block_continuation)
      (code_fence_content
        (block_continuation)
        (block_continuation)
        (block_continuation))
      (fenced_code_block_delimiter))))

================================================================================
Example 113 - https://github.github.com/gfm/#example-113
================================================================================
~~~~    ruby startline=3 $%@#$
def foo(x)
  return 3
end
~~~~~~~

--------------------------------------------------------------------------------

(document
  (section
    (fenced_code_block
      (fenced_code_block_delimiter)
      (info_string
        (language))
      (block_continuation)
      (code_fence_content
        (block_continuation)
        (block_continuation)
        (block_continuation))
      (fenced_code_block_delimiter))))

================================================================================
Example 114 - https://github.github.com/gfm/#example-114
================================================================================
````;
````

--------------------------------------------------------------------------------

(document
  (section
    (fenced_code_block
      (fenced_code_block_delimiter)
      (info_string
        (language))
      (block_continuation)
      (fenced_code_block_delimiter))))

================================================================================
Example 115 - https://github.github.com/gfm/#example-115
================================================================================
``` aa ```
foo

--------------------------------------------------------------------------------

(document
  (section
    (paragraph
      (inline))))

================================================================================
Example 116 - https://github.github.com/gfm/#example-116
================================================================================
~~~ aa ``` ~~~
foo
~~~

--------------------------------------------------------------------------------

(document
  (section
    (fenced_code_block
      (fenced_code_block_delimiter)
      (info_string
        (language))
      (block_continuation)
      (code_fence_content
        (block_continuation))
      (fenced_code_block_delimiter))))

================================================================================
Example 117 - https://github.github.com/gfm/#example-117
================================================================================
```
``` aaa
```

--------------------------------------------------------------------------------

(document
  (section
    (fenced_code_block
      (fenced_code_block_delimiter)
      (block_continuation)
      (code_fence_content
        (block_continuation))
      (fenced_code_block_delimiter))))

================================================================================
Example 118 - https://github.github.com/gfm/#example-118
================================================================================
<table><tr><td>
<pre>
**Hello**,

_world_.
</pre>
</td></tr></table>

--------------------------------------------------------------------------------

(document
  (section
    (html_block
      (block_continuation)
      (block_continuation)
      (block_continuation))
    (paragraph
      (inline))
    (html_block)))

================================================================================
Example 119 - https://github.github.com/gfm/#example-119
================================================================================
<table>
  <tr>
    <td>
           hi
    </td>
  </tr>
</table>

okay.

--------------------------------------------------------------------------------

(document
  (section
    (html_block
      (block_continuation)
      (block_continuation)
      (block_continuation)
      (block_continuation)
      (block_continuation)
      (block_continuation)
      (block_continuation))
    (paragraph
      (inline))))

================================================================================
Example 120 - https://github.github.com/gfm/#example-120
================================================================================
 <div>
  *hello*
         <foo><a>

--------------------------------------------------------------------------------

(document
  (section
    (html_block
      (block_continuation)
      (block_continuation))))

================================================================================
Example 121 - https://github.github.com/gfm/#example-121
================================================================================
</div>
*foo*

--------------------------------------------------------------------------------

(document
  (section
    (html_block
      (block_continuation))))

================================================================================
Example 122 - https://github.github.com/gfm/#example-122
================================================================================
<DIV CLASS="foo">

*Markdown*

</DIV>

--------------------------------------------------------------------------------

(document
  (section
    (html_block
      (block_continuation))
    (paragraph
      (inline))
    (html_block)))

================================================================================
Example 123 - https://github.github.com/gfm/#example-123
================================================================================
<div id="foo"
  class="bar">
</div>

--------------------------------------------------------------------------------

(document
  (section
    (html_block
      (block_continuation)
      (block_continuation))))

================================================================================
Example 124 - https://github.github.com/gfm/#example-124
================================================================================
<div id="foo" class="bar
  baz">
</div>

--------------------------------------------------------------------------------

(document
  (section
    (html_block
      (block_continuation)
      (block_continuation))))

================================================================================
Example 125 - https://github.github.com/gfm/#example-125
================================================================================
<div>
*foo*

*bar*

--------------------------------------------------------------------------------

(document
  (section
    (html_block
      (block_continuation)
      (block_continuation))
    (paragraph
      (inline))))

================================================================================
Example 126 - https://github.github.com/gfm/#example-126
================================================================================
<div id="foo"
*hi*

--------------------------------------------------------------------------------

(document
  (section
    (html_block
      (block_continuation))))

================================================================================
Example 127 - https://github.github.com/gfm/#example-127
================================================================================
<div class
foo

--------------------------------------------------------------------------------

(document
  (section
    (html_block
      (block_continuation))))

================================================================================
Example 128 - https://github.github.com/gfm/#example-128
================================================================================
<div *???-&&&-<---
*foo*

--------------------------------------------------------------------------------

(document
  (section
    (html_block
      (block_continuation))))

================================================================================
Example 129 - https://github.github.com/gfm/#example-129
================================================================================
<div><a href="bar">*foo*</a></div>

--------------------------------------------------------------------------------

(document
  (section
    (html_block)))

================================================================================
Example 130 - https://github.github.com/gfm/#example-130
================================================================================
<table><tr><td>
foo
</td></tr></table>

--------------------------------------------------------------------------------

(document
  (section
    (html_block
      (block_continuation)
      (block_continuation))))

================================================================================
Example 131 - https://github.github.com/gfm/#example-131
================================================================================
<div></div>
``` c
int x = 33;
```

--------------------------------------------------------------------------------

(document
  (section
    (html_block
      (block_continuation)
      (block_continuation)
      (block_continuation))))

================================================================================
Example 132 - https://github.github.com/gfm/#example-132
================================================================================
<a href="foo">
*bar*
</a>

--------------------------------------------------------------------------------

(document
  (section
    (html_block
      (block_continuation)
      (block_continuation))))

================================================================================
Example 133 - https://github.github.com/gfm/#example-133
================================================================================
<Warning>
*bar*
</Warning>

--------------------------------------------------------------------------------

(document
  (section
    (html_block
      (block_continuation)
      (block_continuation))))

================================================================================
Example 134 - https://github.github.com/gfm/#example-134
================================================================================
<i class="foo">
*bar*
</i>

--------------------------------------------------------------------------------

(document
  (section
    (html_block
      (block_continuation)
      (block_continuation))))

================================================================================
Example 135 - https://github.github.com/gfm/#example-135
================================================================================
</ins>
*bar*

--------------------------------------------------------------------------------

(document
  (section
    (html_block
      (block_continuation))))

================================================================================
Example 136 - https://github.github.com/gfm/#example-136
================================================================================
<del>
*foo*
</del>

--------------------------------------------------------------------------------

(document
  (section
    (html_block
      (block_continuation)
      (block_continuation))))

================================================================================
Example 137 - https://github.github.com/gfm/#example-137
================================================================================
<del>

*foo*

</del>

--------------------------------------------------------------------------------

(document
  (section
    (html_block
      (block_continuation))
    (paragraph
      (inline))
    (html_block)))

================================================================================
Example 138 - https://github.github.com/gfm/#example-138
================================================================================
<del>*foo*</del>

--------------------------------------------------------------------------------

(document
  (section
    (paragraph
      (inline))))

================================================================================
Example 139 - https://github.github.com/gfm/#example-139
================================================================================
<pre language="haskell"><code>
import Text.HTML.TagSoup

main :: IO ()
main = print $ parseTags tags
</code></pre>
okay

--------------------------------------------------------------------------------

(document
  (section
    (html_block
      (block_continuation)
      (block_continuation)
      (block_continuation)
      (block_continuation)
      (block_continuation))
    (paragraph
      (inline))))

================================================================================
Example 140 - https://github.github.com/gfm/#example-140
================================================================================
<script type="text/javascript">
// JavaScript example

document.getElementById("demo").innerHTML = "Hello JavaScript!";
</script>
okay

--------------------------------------------------------------------------------

(document
  (section
    (html_block
      (block_continuation)
      (block_continuation)
      (block_continuation)
      (block_continuation))
    (paragraph
      (inline))))

================================================================================
Example 141 - https://github.github.com/gfm/#example-141
================================================================================
<style
  type="text/css">
h1 {color:red;}

p {color:blue;}
</style>
okay

--------------------------------------------------------------------------------

(document
  (section
    (html_block
      (block_continuation)
      (block_continuation)
      (block_continuation)
      (block_continuation)
      (block_continuation))
    (paragraph
      (inline))))

================================================================================
Example 142 - https://github.github.com/gfm/#example-142
================================================================================
<style
  type="text/css">

foo

--------------------------------------------------------------------------------

(document
  (section
    (html_block
      (block_continuation)
      (block_continuation)
      (block_continuation))))

================================================================================
Example 143 - https://github.github.com/gfm/#example-143
================================================================================
> <div>
> foo

bar

--------------------------------------------------------------------------------

(document
  (section
    (block_quote
      (block_quote_marker)
      (html_block
        (block_continuation)))
    (paragraph
      (inline))))

================================================================================
Example 144 - https://github.github.com/gfm/#example-144
================================================================================
- <div>
- foo

--------------------------------------------------------------------------------

(document
  (section
    (list
      (list_item
        (list_marker_minus)
        (html_block))
      (list_item
        (list_marker_minus)
        (paragraph
          (inline))))))

================================================================================
Example 145 - https://github.github.com/gfm/#example-145
================================================================================
<style>p{color:red;}</style>
*foo*

--------------------------------------------------------------------------------

(document
  (section
    (html_block)
    (paragraph
      (inline))))

================================================================================
Example 146 - https://github.github.com/gfm/#example-146
================================================================================
<!-- foo -->*bar*
*baz*

--------------------------------------------------------------------------------

(document
  (section
    (html_block)
    (paragraph
      (inline))))

================================================================================
Example 147 - https://github.github.com/gfm/#example-147
================================================================================
<script>
foo
</script>1. *bar*

--------------------------------------------------------------------------------

(document
  (section
    (html_block
      (block_continuation)
      (block_continuation))))

================================================================================
Example 148 - https://github.github.com/gfm/#example-148
================================================================================
<!-- Foo

bar
   baz -->
okay

--------------------------------------------------------------------------------

(document
  (section
    (html_block
      (block_continuation)
      (block_continuation)
      (block_continuation))
    (paragraph
      (inline))))

================================================================================
Example 149 - https://github.github.com/gfm/#example-149
================================================================================
<?php

  echo '>';

?>
okay

--------------------------------------------------------------------------------

(document
  (section
    (html_block
      (block_continuation)
      (block_continuation)
      (block_continuation)
      (block_continuation))
    (paragraph
      (inline))))

================================================================================
Example 150 - https://github.github.com/gfm/#example-150
================================================================================
<!DOCTYPE html>

--------------------------------------------------------------------------------

(document
  (section
    (html_block)))

================================================================================
Example 151 - https://github.github.com/gfm/#example-151
================================================================================
<![CDATA[
function matchwo(a,b)
{
  if (a < b && a < 0) then {
    return 1;

  } else {

    return 0;
  }
}
]]>
okay

--------------------------------------------------------------------------------

(document
  (section
    (html_block
      (block_continuation)
      (block_continuation)
      (block_continuation)
      (block_continuation)
      (block_continuation)
      (block_continuation)
      (block_continuation)
      (block_continuation)
      (block_continuation)
      (block_continuation)
      (block_continuation))
    (paragraph
      (inline))))

================================================================================
Example 152 - https://github.github.com/gfm/#example-152
================================================================================
  <!-- foo -->

    <!-- foo -->

--------------------------------------------------------------------------------

(document
  (section
    (html_block)
    (indented_code_block)))

================================================================================
Example 153 - https://github.github.com/gfm/#example-153
================================================================================
  <div>

    <div>

--------------------------------------------------------------------------------

(document
  (section
    (html_block
      (block_continuation))
    (indented_code_block)))

================================================================================
Example 154 - https://github.github.com/gfm/#example-154
================================================================================
Foo
<div>
bar
</div>

--------------------------------------------------------------------------------

(document
  (section
    (paragraph
      (inline))
    (html_block
      (block_continuation)
      (block_continuation))))

================================================================================
Example 155 - https://github.github.com/gfm/#example-155
================================================================================
<div>
bar
</div>
*foo*

--------------------------------------------------------------------------------

(document
  (section
    (html_block
      (block_continuation)
      (block_continuation)
      (block_continuation))))

================================================================================
Example 156 - https://github.github.com/gfm/#example-156
================================================================================
Foo
<a href="bar">
baz

--------------------------------------------------------------------------------

(document
  (section
    (paragraph
      (inline))))

================================================================================
Example 157 - https://github.github.com/gfm/#example-157
================================================================================
<div>

*Emphasized* text.

</div>

--------------------------------------------------------------------------------

(document
  (section
    (html_block
      (block_continuation))
    (paragraph
      (inline))
    (html_block)))

================================================================================
Example 158 - https://github.github.com/gfm/#example-158
================================================================================
<div>
*Emphasized* text.
</div>

--------------------------------------------------------------------------------

(document
  (section
    (html_block
      (block_continuation)
      (block_continuation))))

================================================================================
Example 159 - https://github.github.com/gfm/#example-159
================================================================================
<table>

<tr>

<td>
Hi
</td>

</tr>

</table>

--------------------------------------------------------------------------------

(document
  (section
    (html_block
      (block_continuation))
    (html_block
      (block_continuation))
    (html_block
      (block_continuation)
      (block_continuation)
      (block_continuation))
    (html_block
      (block_continuation))
    (html_block)))

================================================================================
Example 160 - https://github.github.com/gfm/#example-160
================================================================================
<table>

  <tr>

    <td>
      Hi
    </td>

  </tr>

</table>

--------------------------------------------------------------------------------

(document
  (section
    (html_block
      (block_continuation))
    (html_block
      (block_continuation))
    (indented_code_block
      (block_continuation)
      (block_continuation))
    (html_block
      (block_continuation))
    (html_block)))

================================================================================
Example 161 - https://github.github.com/gfm/#example-161
================================================================================
[foo]: /url "title"

[foo]

--------------------------------------------------------------------------------

(document
  (section
    (link_reference_definition
      (link_label)
      (link_destination)
      (link_title))
    (paragraph
      (inline))))

================================================================================
Example 162 - https://github.github.com/gfm/#example-162
================================================================================
   [foo]:
      /url
           'the title'

[foo]

--------------------------------------------------------------------------------

(document
  (section
    (link_reference_definition
      (link_label)
      (link_destination)
      (link_title))
    (paragraph
      (inline))))

================================================================================
Example 163 - https://github.github.com/gfm/#example-163
================================================================================
[Foo*bar\]]:my_(url) 'title (with parens)'

[Foo*bar\]]

--------------------------------------------------------------------------------

(document
  (section
    (link_reference_definition
      (link_label
        (backslash_escape))
      (link_destination)
      (link_title))
    (paragraph
      (inline))))

================================================================================
Example 164 - https://github.github.com/gfm/#example-164
================================================================================
[Foo bar]:
<my url>
'title'

[Foo bar]

--------------------------------------------------------------------------------

(document
  (section
    (link_reference_definition
      (link_label)
      (link_destination)
      (link_title))
    (paragraph
      (inline))))

================================================================================
Example 165 - https://github.github.com/gfm/#example-165
================================================================================
[foo]: /url '
title
line1
line2
'

[foo]

--------------------------------------------------------------------------------

(document
  (section
    (link_reference_definition
      (link_label)
      (link_destination)
      (link_title))
    (paragraph
      (inline))))

================================================================================
Example 166 - https://github.github.com/gfm/#example-166
================================================================================
[foo]: /url 'title

with blank line'

[foo]

--------------------------------------------------------------------------------

(document
  (section
    (paragraph
      (inline))
    (paragraph
      (inline))
    (paragraph
      (inline))))

================================================================================
Example 167 - https://github.github.com/gfm/#example-167
================================================================================
[foo]:
/url

[foo]

--------------------------------------------------------------------------------

(document
  (section
    (link_reference_definition
      (link_label)
      (link_destination))
    (paragraph
      (inline))))

================================================================================
Example 168 - https://github.github.com/gfm/#example-168
================================================================================
[foo]:

[foo]

--------------------------------------------------------------------------------

(document
  (section
    (paragraph
      (inline))
    (paragraph
      (inline))))

================================================================================
Example 169 - https://github.github.com/gfm/#example-169
================================================================================
[foo]: <>

[foo]

--------------------------------------------------------------------------------

(document
  (section
    (link_reference_definition
      (link_label)
      (link_destination))
    (paragraph
      (inline))))

================================================================================
Example 170 - https://github.github.com/gfm/#example-170
================================================================================
[foo]: <bar>(baz)

[foo]

--------------------------------------------------------------------------------

(document
  (section
    (paragraph
      (inline))
    (paragraph
      (inline))))

================================================================================
Example 171 - https://github.github.com/gfm/#example-171
================================================================================
[foo]: /url\bar\*baz "foo\"bar\baz"

[foo]

--------------------------------------------------------------------------------

(document
  (section
    (link_reference_definition
      (link_label)
      (link_destination
        (backslash_escape))
      (link_title
        (backslash_escape)))
    (paragraph
      (inline))))

================================================================================
Example 172 - https://github.github.com/gfm/#example-172
================================================================================
[foo]

[foo]: url

--------------------------------------------------------------------------------

(document
  (section
    (paragraph
      (inline))
    (link_reference_definition
      (link_label)
      (link_destination))))

================================================================================
Example 173 - https://github.github.com/gfm/#example-173
================================================================================
[foo]

[foo]: first
[foo]: second

--------------------------------------------------------------------------------

(document
  (section
    (paragraph
      (inline))
    (link_reference_definition
      (link_label)
      (link_destination))
    (link_reference_definition
      (link_label)
      (link_destination))))

================================================================================
Example 174 - https://github.github.com/gfm/#example-174
================================================================================
[FOO]: /url

[Foo]

--------------------------------------------------------------------------------

(document
  (section
    (link_reference_definition
      (link_label)
      (link_destination))
    (paragraph
      (inline))))

================================================================================
Example 175 - https://github.github.com/gfm/#example-175
================================================================================
[ΑΓΩ]: /φου

[αγω]

--------------------------------------------------------------------------------

(document
  (section
    (link_reference_definition
      (link_label)
      (link_destination))
    (paragraph
      (inline))))

================================================================================
Example 176 - https://github.github.com/gfm/#example-176
================================================================================
[foo]: /url

--------------------------------------------------------------------------------

(document
  (section
    (link_reference_definition
      (link_label)
      (link_destination))))

================================================================================
Example 177 - https://github.github.com/gfm/#example-177
================================================================================
[
foo
]: /url
bar

--------------------------------------------------------------------------------

(document
  (section
    (link_reference_definition
      (link_label)
      (link_destination))
    (paragraph
      (inline))))

================================================================================
Example 178 - https://github.github.com/gfm/#example-178
================================================================================
[foo]: /url "title" ok

--------------------------------------------------------------------------------

(document
  (section
    (paragraph
      (inline))))

================================================================================
Example 179 - https://github.github.com/gfm/#example-179
================================================================================
[foo]: /url
"title" ok

--------------------------------------------------------------------------------

(document
  (section
    (link_reference_definition
      (link_label)
      (link_destination))
    (paragraph
      (inline))))

================================================================================
Example 180 - https://github.github.com/gfm/#example-180
================================================================================
    [foo]: /url "title"

[foo]

--------------------------------------------------------------------------------

(document
  (section
    (indented_code_block)
    (paragraph
      (inline))))

================================================================================
Example 181 - https://github.github.com/gfm/#example-181
================================================================================
```
[foo]: /url
```

[foo]

--------------------------------------------------------------------------------

(document
  (section
    (fenced_code_block
      (fenced_code_block_delimiter)
      (block_continuation)
      (code_fence_content
        (block_continuation))
      (fenced_code_block_delimiter))
    (paragraph
      (inline))))

================================================================================
Example 182 - https://github.github.com/gfm/#example-182
================================================================================
Foo
[bar]: /baz

[bar]

--------------------------------------------------------------------------------

(document
  (section
    (paragraph
      (inline))
    (paragraph
      (inline))))

================================================================================
Example 183 - https://github.github.com/gfm/#example-183
================================================================================
# [Foo]
[foo]: /url
> bar

--------------------------------------------------------------------------------

(document
  (section
    (atx_heading
      (atx_h1_marker)
      (inline))
    (link_reference_definition
      (link_label)
      (link_destination))
    (block_quote
      (block_quote_marker)
      (paragraph
        (inline)))))

================================================================================
Example 184 - https://github.github.com/gfm/#example-184
================================================================================
[foo]: /url
bar
=
[foo]

--------------------------------------------------------------------------------

(document
  (section
    (link_reference_definition
      (link_label)
      (link_destination)))
  (section
    (setext_heading
      (paragraph
        (inline))
      (setext_h1_underline))
    (paragraph
      (inline))))

================================================================================
Example 185 - https://github.github.com/gfm/#example-185
================================================================================
[foo]: /url
=
[foo]

--------------------------------------------------------------------------------

(document
  (section
    (link_reference_definition
      (link_label)
      (link_destination))
    (paragraph
      (inline))))

================================================================================
Example 186 - https://github.github.com/gfm/#example-186
================================================================================
[foo]: /foo-url "foo"
[bar]: /bar-url
  "bar"
[baz]: /baz-url

[foo],
[bar],
[baz]

--------------------------------------------------------------------------------

(document
  (section
    (link_reference_definition
      (link_label)
      (link_destination)
      (link_title))
    (link_reference_definition
      (link_label)
      (link_destination)
      (link_title))
    (link_reference_definition
      (link_label)
      (link_destination))
    (paragraph
      (inline))))

================================================================================
Example 187 - https://github.github.com/gfm/#example-187
================================================================================
[foo]

> [foo]: /url

--------------------------------------------------------------------------------

(document
  (section
    (paragraph
      (inline))
    (block_quote
      (block_quote_marker)
      (link_reference_definition
        (link_label)
        (link_destination)))))

================================================================================
Example 188 - https://github.github.com/gfm/#example-188
================================================================================
[foo]: /url

--------------------------------------------------------------------------------

(document
  (section
    (link_reference_definition
      (link_label)
      (link_destination))))

================================================================================
Example 189 - https://github.github.com/gfm/#example-189
================================================================================
aaa

bbb

--------------------------------------------------------------------------------

(document
  (section
    (paragraph
      (inline))
    (paragraph
      (inline))))

================================================================================
Example 190 - https://github.github.com/gfm/#example-190
================================================================================
aaa
bbb

ccc
ddd

--------------------------------------------------------------------------------

(document
  (section
    (paragraph
      (inline))
    (paragraph
      (inline))))

================================================================================
Example 191 - https://github.github.com/gfm/#example-191
================================================================================
aaa


bbb

--------------------------------------------------------------------------------

(document
  (section
    (paragraph
      (inline))
    (paragraph
      (inline))))

================================================================================
Example 192 - https://github.github.com/gfm/#example-192
================================================================================
  aaa
 bbb

--------------------------------------------------------------------------------

(document
  (section
    (paragraph
      (inline))))

================================================================================
Example 193 - https://github.github.com/gfm/#example-193
================================================================================
aaa
             bbb
                                       ccc

--------------------------------------------------------------------------------

(document
  (section
    (paragraph
      (inline))))

================================================================================
Example 194 - https://github.github.com/gfm/#example-194
================================================================================
   aaa
bbb

--------------------------------------------------------------------------------

(document
  (section
    (paragraph
      (inline))))

================================================================================
Example 195 - https://github.github.com/gfm/#example-195
================================================================================
    aaa
bbb

--------------------------------------------------------------------------------

(document
  (section
    (indented_code_block)
    (paragraph
      (inline))))

================================================================================
Example 196 - https://github.github.com/gfm/#example-196
================================================================================
aaa  
bbb

--------------------------------------------------------------------------------

(document
  (section
    (paragraph
      (inline))))

================================================================================
Example 197 - https://github.github.com/gfm/#example-197
================================================================================


aaa


# aaa



--------------------------------------------------------------------------------

(document
  (section
    (paragraph
      (inline)))
  (section
    (atx_heading
      (atx_h1_marker)
      (inline))))

================================================================================
Example 206 - https://github.github.com/gfm/#example-206
================================================================================
> # Foo
> bar
> baz

--------------------------------------------------------------------------------

(document
  (section
    (block_quote
      (block_quote_marker)
      (section
        (atx_heading
          (atx_h1_marker)
          (inline)
          (block_continuation))
        (paragraph
          (inline
            (block_continuation)))))))

================================================================================
Example 207 - https://github.github.com/gfm/#example-207
================================================================================
># Foo
>bar
> baz

--------------------------------------------------------------------------------

(document
  (section
    (block_quote
      (block_quote_marker)
      (section
        (atx_heading
          (atx_h1_marker)
          (inline)
          (block_continuation))
        (paragraph
          (inline
            (block_continuation)))))))

================================================================================
Example 208 - https://github.github.com/gfm/#example-208
================================================================================
   > # Foo
   > bar
 > baz

--------------------------------------------------------------------------------

(document
  (section
    (block_quote
      (block_quote_marker)
      (section
        (atx_heading
          (atx_h1_marker)
          (inline)
          (block_continuation))
        (paragraph
          (inline
            (block_continuation)))))))

================================================================================
Example 209 - https://github.github.com/gfm/#example-209
================================================================================
    > # Foo
    > bar
    > baz

--------------------------------------------------------------------------------

(document
  (section
    (indented_code_block
      (block_continuation)
      (block_continuation))))

================================================================================
Example 210 - https://github.github.com/gfm/#example-210
================================================================================
> # Foo
> bar
baz

--------------------------------------------------------------------------------

(document
  (section
    (block_quote
      (block_quote_marker)
      (section
        (atx_heading
          (atx_h1_marker)
          (inline)
          (block_continuation))
        (paragraph
          (inline))))))

================================================================================
Example 211 - https://github.github.com/gfm/#example-211
================================================================================
> bar
baz
> foo

--------------------------------------------------------------------------------

(document
  (section
    (block_quote
      (block_quote_marker)
      (paragraph
        (inline
          (block_continuation))))))

================================================================================
Example 212 - https://github.github.com/gfm/#example-212
================================================================================
> foo
---

--------------------------------------------------------------------------------

(document
  (section
    (block_quote
      (block_quote_marker)
      (paragraph
        (inline)))
    (thematic_break)))

================================================================================
Example 213 - https://github.github.com/gfm/#example-213
================================================================================
> - foo
- bar

--------------------------------------------------------------------------------

(document
  (section
    (block_quote
      (block_quote_marker)
      (list
        (list_item
          (list_marker_minus)
          (paragraph
            (inline)))))
    (list
      (list_item
        (list_marker_minus)
        (paragraph
          (inline))))))

================================================================================
Example 214 - https://github.github.com/gfm/#example-214
================================================================================
>     foo
    bar

--------------------------------------------------------------------------------

(document
  (section
    (block_quote
      (block_quote_marker)
      (indented_code_block))
    (indented_code_block)))

================================================================================
Example 215 - https://github.github.com/gfm/#example-215
================================================================================
> ```
foo
```

--------------------------------------------------------------------------------

(document
  (section
    (block_quote
      (block_quote_marker)
      (fenced_code_block
        (fenced_code_block_delimiter)))
    (paragraph
      (inline))
    (fenced_code_block
      (fenced_code_block_delimiter))))

================================================================================
Example 216 - https://github.github.com/gfm/#example-216
================================================================================
> foo
    - bar

--------------------------------------------------------------------------------

(document
  (section
    (block_quote
      (block_quote_marker)
      (paragraph
        (inline)))))

================================================================================
Example 217 - https://github.github.com/gfm/#example-217
================================================================================
>

--------------------------------------------------------------------------------

(document
  (section
    (block_quote
      (block_quote_marker))))

================================================================================
Example 218 - https://github.github.com/gfm/#example-218
================================================================================
>
>
>

--------------------------------------------------------------------------------

(document
  (section
    (block_quote
      (block_quote_marker)
      (block_continuation)
      (block_continuation))))

================================================================================
Example 219 - https://github.github.com/gfm/#example-219
================================================================================
>
> foo
>

--------------------------------------------------------------------------------

(document
  (section
    (block_quote
      (block_quote_marker)
      (block_continuation)
      (paragraph
        (inline)
        (block_continuation)))))

================================================================================
Example 220 - https://github.github.com/gfm/#example-220
================================================================================
> foo

> bar

--------------------------------------------------------------------------------

(document
  (section
    (block_quote
      (block_quote_marker)
      (paragraph
        (inline)))
    (block_quote
      (block_quote_marker)
      (paragraph
        (inline)))))

================================================================================
Example 221 - https://github.github.com/gfm/#example-221
================================================================================
> foo
> bar

--------------------------------------------------------------------------------

(document
  (section
    (block_quote
      (block_quote_marker)
      (paragraph
        (inline
          (block_continuation))))))

================================================================================
Example 222 - https://github.github.com/gfm/#example-222
================================================================================
> foo
>
> bar

--------------------------------------------------------------------------------

(document
  (section
    (block_quote
      (block_quote_marker)
      (paragraph
        (inline)
        (block_continuation))
      (block_continuation)
      (paragraph
        (inline)))))

================================================================================
Example 223 - https://github.github.com/gfm/#example-223
================================================================================
foo
> bar

--------------------------------------------------------------------------------

(document
  (section
    (paragraph
      (inline))
    (block_quote
      (block_quote_marker)
      (paragraph
        (inline)))))

================================================================================
Example 224 - https://github.github.com/gfm/#example-224
================================================================================
> aaa
***
> bbb

--------------------------------------------------------------------------------

(document
  (section
    (block_quote
      (block_quote_marker)
      (paragraph
        (inline)))
    (thematic_break)
    (block_quote
      (block_quote_marker)
      (paragraph
        (inline)))))

================================================================================
Example 225 - https://github.github.com/gfm/#example-225
================================================================================
> bar
baz

--------------------------------------------------------------------------------

(document
  (section
    (block_quote
      (block_quote_marker)
      (paragraph
        (inline)))))

================================================================================
Example 226 - https://github.github.com/gfm/#example-226
================================================================================
> bar

baz

--------------------------------------------------------------------------------

(document
  (section
    (block_quote
      (block_quote_marker)
      (paragraph
        (inline)))
    (paragraph
      (inline))))

================================================================================
Example 227 - https://github.github.com/gfm/#example-227
================================================================================
> bar
>
baz

--------------------------------------------------------------------------------

(document
  (section
    (block_quote
      (block_quote_marker)
      (paragraph
        (inline)
        (block_continuation)))
    (paragraph
      (inline))))

================================================================================
Example 228 - https://github.github.com/gfm/#example-228
================================================================================
> > > foo
bar

--------------------------------------------------------------------------------

(document
  (section
    (block_quote
      (block_quote_marker)
      (block_quote
        (block_quote_marker)
        (block_quote
          (block_quote_marker)
          (paragraph
            (inline)))))))

================================================================================
Example 229 - https://github.github.com/gfm/#example-229
================================================================================
>>> foo
> bar
>>baz

--------------------------------------------------------------------------------

(document
  (section
    (block_quote
      (block_quote_marker)
      (block_quote
        (block_quote_marker)
        (block_quote
          (block_quote_marker)
          (paragraph
            (inline
              (block_continuation)
              (block_continuation))))))))

================================================================================
Example 230 - https://github.github.com/gfm/#example-230
================================================================================
>     code

>    not code

--------------------------------------------------------------------------------

(document
  (section
    (block_quote
      (block_quote_marker)
      (indented_code_block))
    (block_quote
      (block_quote_marker)
      (paragraph
        (inline)))))

================================================================================
Example 231 - https://github.github.com/gfm/#example-231
================================================================================
A paragraph
with two lines.

    indented code

> A block quote.

--------------------------------------------------------------------------------

(document
  (section
    (paragraph
      (inline))
    (indented_code_block)
    (block_quote
      (block_quote_marker)
      (paragraph
        (inline)))))

================================================================================
Example 232 - https://github.github.com/gfm/#example-232
================================================================================
1.  A paragraph
    with two lines.

        indented code

    > A block quote.

--------------------------------------------------------------------------------

(document
  (section
    (list
      (list_item
        (list_marker_dot)
        (paragraph
          (inline
            (block_continuation))
          (block_continuation))
        (block_continuation)
        (indented_code_block
          (block_continuation)
          (block_continuation))
        (block_quote
          (block_quote_marker)
          (paragraph
            (inline)))))))

================================================================================
Example 233 - https://github.github.com/gfm/#example-233
================================================================================
- one

 two

--------------------------------------------------------------------------------

(document
  (section
    (list
      (list_item
        (list_marker_minus)
        (paragraph
          (inline)
          (block_continuation))))
    (paragraph
      (inline))))

================================================================================
Example 234 - https://github.github.com/gfm/#example-234
================================================================================
- one

  two

--------------------------------------------------------------------------------

(document
  (section
    (list
      (list_item
        (list_marker_minus)
        (paragraph
          (inline)
          (block_continuation))
        (block_continuation)
        (paragraph
          (inline))))))

================================================================================
Example 235 - https://github.github.com/gfm/#example-235
================================================================================
 -    one

     two

--------------------------------------------------------------------------------

(document
  (section
    (list
      (list_item
        (list_marker_minus)
        (paragraph
          (inline)
          (block_continuation))))
    (indented_code_block)))

================================================================================
Example 236 - https://github.github.com/gfm/#example-236
================================================================================
 -    one

      two

--------------------------------------------------------------------------------

(document
  (section
    (list
      (list_item
        (list_marker_minus)
        (paragraph
          (inline)
          (block_continuation))
        (block_continuation)
        (paragraph
          (inline))))))

================================================================================
Example 237 - https://github.github.com/gfm/#example-237
================================================================================
   > > 1.  one
>>
>>     two

--------------------------------------------------------------------------------

(document
  (section
    (block_quote
      (block_quote_marker)
      (block_quote
        (block_quote_marker)
        (list
          (list_item
            (list_marker_dot)
            (paragraph
              (inline)
              (block_continuation))
            (block_continuation)
            (paragraph
              (inline))))))))

================================================================================
Example 238 - https://github.github.com/gfm/#example-238
================================================================================
>>- one
>>
  >  > two

--------------------------------------------------------------------------------

(document
  (section
    (block_quote
      (block_quote_marker)
      (block_quote
        (block_quote_marker)
        (list
          (list_item
            (list_marker_minus)
            (paragraph
              (inline)
              (block_continuation))
            (block_continuation)))
        (paragraph
          (inline))))))

================================================================================
Example 239 - https://github.github.com/gfm/#example-239
================================================================================
-one

2.two

--------------------------------------------------------------------------------

(document
  (section
    (paragraph
      (inline))
    (paragraph
      (inline))))

================================================================================
Example 240 - https://github.github.com/gfm/#example-240
================================================================================
- foo


  bar

--------------------------------------------------------------------------------

(document
  (section
    (list
      (list_item
        (list_marker_minus)
        (paragraph
          (inline)
          (block_continuation))
        (block_continuation)
        (block_continuation)
        (paragraph
          (inline))))))

================================================================================
Example 241 - https://github.github.com/gfm/#example-241
================================================================================
1.  foo

    ```
    bar
    ```

    baz

    > bam

--------------------------------------------------------------------------------

(document
  (section
    (list
      (list_item
        (list_marker_dot)
        (paragraph
          (inline)
          (block_continuation))
        (block_continuation)
        (fenced_code_block
          (fenced_code_block_delimiter)
          (block_continuation)
          (code_fence_content
            (block_continuation))
          (fenced_code_block_delimiter)
          (block_continuation))
        (block_continuation)
        (paragraph
          (inline)
          (block_continuation))
        (block_continuation)
        (block_quote
          (block_quote_marker)
          (paragraph
            (inline)))))))

================================================================================
Example 242 - https://github.github.com/gfm/#example-242
================================================================================
- Foo

      bar


      baz

--------------------------------------------------------------------------------

(document
  (section
    (list
      (list_item
        (list_marker_minus)
        (paragraph
          (inline)
          (block_continuation))
        (block_continuation)
        (indented_code_block
          (block_continuation)
          (block_continuation)
          (block_continuation))))))

================================================================================
Example 243 - https://github.github.com/gfm/#example-243
================================================================================
123456789. ok

--------------------------------------------------------------------------------

(document
  (section
    (list
      (list_item
        (list_marker_dot)
        (paragraph
          (inline))))))

================================================================================
Example 244 - https://github.github.com/gfm/#example-244
================================================================================
1234567890. not ok

--------------------------------------------------------------------------------

(document
  (section
    (paragraph
      (inline))))

================================================================================
Example 245 - https://github.github.com/gfm/#example-245
================================================================================
0. ok

--------------------------------------------------------------------------------

(document
  (section
    (list
      (list_item
        (list_marker_dot)
        (paragraph
          (inline))))))

================================================================================
Example 246 - https://github.github.com/gfm/#example-246
================================================================================
003. ok

--------------------------------------------------------------------------------

(document
  (section
    (list
      (list_item
        (list_marker_dot)
        (paragraph
          (inline))))))

================================================================================
Example 247 - https://github.github.com/gfm/#example-247
================================================================================
-1. not ok

--------------------------------------------------------------------------------

(document
  (section
    (paragraph
      (inline))))

================================================================================
Example 248 - https://github.github.com/gfm/#example-248
================================================================================
- foo

      bar

--------------------------------------------------------------------------------

(document
  (section
    (list
      (list_item
        (list_marker_minus)
        (paragraph
          (inline)
          (block_continuation))
        (block_continuation)
        (indented_code_block)))))

================================================================================
Example 249 - https://github.github.com/gfm/#example-249
================================================================================
  10.  foo

           bar

--------------------------------------------------------------------------------

(document
  (section
    (list
      (list_item
        (list_marker_dot)
        (paragraph
          (inline)
          (block_continuation))
        (block_continuation)
        (indented_code_block)))))

================================================================================
Example 250 - https://github.github.com/gfm/#example-250
================================================================================
    indented code

paragraph

    more code

--------------------------------------------------------------------------------

(document
  (section
    (indented_code_block)
    (paragraph
      (inline))
    (indented_code_block)))

================================================================================
Example 251 - https://github.github.com/gfm/#example-251
================================================================================
1.     indented code

   paragraph

       more code

--------------------------------------------------------------------------------

(document
  (section
    (list
      (list_item
        (list_marker_dot)
        (indented_code_block
          (block_continuation)
          (block_continuation))
        (paragraph
          (inline)
          (block_continuation))
        (block_continuation)
        (indented_code_block)))))

================================================================================
Example 252 - https://github.github.com/gfm/#example-252
================================================================================
1.      indented code

   paragraph

       more code

--------------------------------------------------------------------------------

(document
  (section
    (list
      (list_item
        (list_marker_dot)
        (indented_code_block
          (block_continuation)
          (block_continuation))
        (paragraph
          (inline)
          (block_continuation))
        (block_continuation)
        (indented_code_block)))))

================================================================================
Example 253 - https://github.github.com/gfm/#example-253
================================================================================
   foo

bar

--------------------------------------------------------------------------------

(document
  (section
    (paragraph
      (inline))
    (paragraph
      (inline))))

================================================================================
Example 254 - https://github.github.com/gfm/#example-254
================================================================================
-    foo

  bar

--------------------------------------------------------------------------------

(document
  (section
    (list
      (list_item
        (list_marker_minus)
        (paragraph
          (inline)
          (block_continuation))))
    (paragraph
      (inline))))

================================================================================
Example 255 - https://github.github.com/gfm/#example-255
================================================================================
-  foo

   bar

--------------------------------------------------------------------------------

(document
  (section
    (list
      (list_item
        (list_marker_minus)
        (paragraph
          (inline)
          (block_continuation))
        (block_continuation)
        (paragraph
          (inline))))))

================================================================================
Example 256 - https://github.github.com/gfm/#example-256
================================================================================
-
  foo
-
  ```
  bar
  ```
-
      baz

--------------------------------------------------------------------------------

(document
  (section
    (list
      (list_item
        (list_marker_minus)
        (block_continuation)
        (paragraph
          (inline)))
      (list_item
        (list_marker_minus)
        (block_continuation)
        (fenced_code_block
          (fenced_code_block_delimiter)
          (block_continuation)
          (code_fence_content
            (block_continuation))
          (fenced_code_block_delimiter)))
      (list_item
        (list_marker_minus)
        (block_continuation)
        (indented_code_block)))))

================================================================================
Example 257 - https://github.github.com/gfm/#example-257
================================================================================
-
  foo

--------------------------------------------------------------------------------

(document
  (section
    (list
      (list_item
        (list_marker_minus)
        (block_continuation)
        (paragraph
          (inline))))))

================================================================================
Example 258 - https://github.github.com/gfm/#example-258
================================================================================
-

  foo

--------------------------------------------------------------------------------

(document
  (section
    (list
      (list_item
        (list_marker_minus)
        (block_continuation)))
    (paragraph
      (inline))))

================================================================================
Example 259 - https://github.github.com/gfm/#example-259
================================================================================
- foo
-
- bar

--------------------------------------------------------------------------------

(document
  (section
    (list
      (list_item
        (list_marker_minus)
        (paragraph
          (inline)))
      (list_item
        (list_marker_minus))
      (list_item
        (list_marker_minus)
        (paragraph
          (inline))))))

================================================================================
Example 260 - https://github.github.com/gfm/#example-260
================================================================================
- foo
-
- bar

--------------------------------------------------------------------------------

(document
  (section
    (list
      (list_item
        (list_marker_minus)
        (paragraph
          (inline)))
      (list_item
        (list_marker_minus))
      (list_item
        (list_marker_minus)
        (paragraph
          (inline))))))

================================================================================
Example 261 - https://github.github.com/gfm/#example-261
================================================================================
1. foo
2.
3. bar

--------------------------------------------------------------------------------

(document
  (section
    (list
      (list_item
        (list_marker_dot)
        (paragraph
          (inline)))
      (list_item
        (list_marker_dot))
      (list_item
        (list_marker_dot)
        (paragraph
          (inline))))))

================================================================================
Example 262 - https://github.github.com/gfm/#example-262
================================================================================
*

--------------------------------------------------------------------------------

(document
  (section
    (list
      (list_item
        (list_marker_star)))))

================================================================================
Example 263 - https://github.github.com/gfm/#example-263
================================================================================
foo
*

foo
1.

--------------------------------------------------------------------------------

(document
  (section
    (paragraph
      (inline))
    (paragraph
      (inline))))

================================================================================
Example 264 - https://github.github.com/gfm/#example-264
================================================================================
 1.  A paragraph
     with two lines.

         indented code

     > A block quote.

--------------------------------------------------------------------------------

(document
  (section
    (list
      (list_item
        (list_marker_dot)
        (paragraph
          (inline
            (block_continuation))
          (block_continuation))
        (block_continuation)
        (indented_code_block
          (block_continuation)
          (block_continuation))
        (block_quote
          (block_quote_marker)
          (paragraph
            (inline)))))))

================================================================================
Example 265 - https://github.github.com/gfm/#example-265
================================================================================
  1.  A paragraph
      with two lines.

          indented code

      > A block quote.

--------------------------------------------------------------------------------

(document
  (section
    (list
      (list_item
        (list_marker_dot)
        (paragraph
          (inline
            (block_continuation))
          (block_continuation))
        (block_continuation)
        (indented_code_block
          (block_continuation)
          (block_continuation))
        (block_quote
          (block_quote_marker)
          (paragraph
            (inline)))))))

================================================================================
Example 266 - https://github.github.com/gfm/#example-266
================================================================================
   1.  A paragraph
       with two lines.

           indented code

       > A block quote.

--------------------------------------------------------------------------------

(document
  (section
    (list
      (list_item
        (list_marker_dot)
        (paragraph
          (inline
            (block_continuation))
          (block_continuation))
        (block_continuation)
        (indented_code_block
          (block_continuation)
          (block_continuation))
        (block_quote
          (block_quote_marker)
          (paragraph
            (inline)))))))

================================================================================
Example 267 - https://github.github.com/gfm/#example-267
================================================================================
    1.  A paragraph
        with two lines.

            indented code

        > A block quote.

--------------------------------------------------------------------------------

(document
  (section
    (indented_code_block
      (block_continuation))))

================================================================================
Example 268 - https://github.github.com/gfm/#example-268
================================================================================
  1.  A paragraph
with two lines.

          indented code

      > A block quote.

--------------------------------------------------------------------------------

(document
  (section
    (list
      (list_item
        (list_marker_dot)
        (paragraph
          (inline)
          (block_continuation))
        (block_continuation)
        (indented_code_block
          (block_continuation)
          (block_continuation))
        (block_quote
          (block_quote_marker)
          (paragraph
            (inline)))))))

================================================================================
Example 269 - https://github.github.com/gfm/#example-269
================================================================================
  1.  A paragraph
    with two lines.

--------------------------------------------------------------------------------

(document
  (section
    (list
      (list_item
        (list_marker_dot)
        (paragraph
          (inline))))))

================================================================================
Example 270 - https://github.github.com/gfm/#example-270
================================================================================
> 1. > Blockquote
continued here.

--------------------------------------------------------------------------------

(document
  (section
    (block_quote
      (block_quote_marker)
      (list
        (list_item
          (list_marker_dot)
          (block_quote
            (block_quote_marker)
            (paragraph
              (inline))))))))

================================================================================
Example 271 - https://github.github.com/gfm/#example-271
================================================================================
> 1. > Blockquote
> continued here.

--------------------------------------------------------------------------------

(document
  (section
    (block_quote
      (block_quote_marker)
      (list
        (list_item
          (list_marker_dot)
          (block_quote
            (block_quote_marker)
            (paragraph
              (inline
                (block_continuation)))))))))

================================================================================
Example 272 - https://github.github.com/gfm/#example-272
================================================================================
- foo
  - bar
    - baz
      - boo

--------------------------------------------------------------------------------

(document
  (section
    (list
      (list_item
        (list_marker_minus)
        (paragraph
          (inline)
          (block_continuation))
        (list
          (list_item
            (list_marker_minus)
            (paragraph
              (inline)
              (block_continuation))
            (list
              (list_item
                (list_marker_minus)
                (paragraph
                  (inline)
                  (block_continuation))
                (list
                  (list_item
                    (list_marker_minus)
                    (paragraph
                      (inline))))))))))))

================================================================================
Example 273 - https://github.github.com/gfm/#example-273
================================================================================
- foo
 - bar
  - baz
   - boo

--------------------------------------------------------------------------------

(document
  (section
    (list
      (list_item
        (list_marker_minus)
        (paragraph
          (inline)))
      (list_item
        (list_marker_minus)
        (paragraph
          (inline)))
      (list_item
        (list_marker_minus)
        (paragraph
          (inline)))
      (list_item
        (list_marker_minus)
        (paragraph
          (inline))))))

================================================================================
Example 274 - https://github.github.com/gfm/#example-274
================================================================================
10) foo
    - bar

--------------------------------------------------------------------------------

(document
  (section
    (list
      (list_item
        (list_marker_parenthesis)
        (paragraph
          (inline)
          (block_continuation))
        (list
          (list_item
            (list_marker_minus)
            (paragraph
              (inline))))))))

================================================================================
Example 275 - https://github.github.com/gfm/#example-275
================================================================================
10) foo
   - bar

--------------------------------------------------------------------------------

(document
  (section
    (list
      (list_item
        (list_marker_parenthesis)
        (paragraph
          (inline))))
    (list
      (list_item
        (list_marker_minus)
        (paragraph
          (inline))))))

================================================================================
Example 276 - https://github.github.com/gfm/#example-276
================================================================================
- - foo

--------------------------------------------------------------------------------

(document
  (section
    (list
      (list_item
        (list_marker_minus)
        (list
          (list_item
            (list_marker_minus)
            (paragraph
              (inline))))))))

================================================================================
Example 277 - https://github.github.com/gfm/#example-277
================================================================================
1. - 2. foo

--------------------------------------------------------------------------------

(document
  (section
    (list
      (list_item
        (list_marker_dot)
        (list
          (list_item
            (list_marker_minus)
            (list
              (list_item
                (list_marker_dot)
                (paragraph
                  (inline))))))))))

================================================================================
Example 278 - https://github.github.com/gfm/#example-278
================================================================================
- # Foo
- Bar
  ---
  baz

--------------------------------------------------------------------------------

(document
  (section
    (list
      (list_item
        (list_marker_minus)
        (section
          (atx_heading
            (atx_h1_marker)
            (inline))))
      (list_item
        (list_marker_minus)
        (section
          (setext_heading
            (paragraph
              (inline)
              (block_continuation))
            (setext_h2_underline)
            (block_continuation))
          (paragraph
            (inline)))))))

================================================================================
Example 281 - https://github.github.com/gfm/#example-281
================================================================================
- foo
- bar
+ baz

--------------------------------------------------------------------------------

(document
  (section
    (list
      (list_item
        (list_marker_minus)
        (paragraph
          (inline)))
      (list_item
        (list_marker_minus)
        (paragraph
          (inline))))
    (list
      (list_item
        (list_marker_plus)
        (paragraph
          (inline))))))

================================================================================
Example 282 - https://github.github.com/gfm/#example-282
================================================================================
1. foo
2. bar
3) baz

--------------------------------------------------------------------------------

(document
  (section
    (list
      (list_item
        (list_marker_dot)
        (paragraph
          (inline)))
      (list_item
        (list_marker_dot)
        (paragraph
          (inline))))
    (list
      (list_item
        (list_marker_parenthesis)
        (paragraph
          (inline))))))

================================================================================
Example 283 - https://github.github.com/gfm/#example-283
================================================================================
Foo
- bar
- baz

--------------------------------------------------------------------------------

(document
  (section
    (paragraph
      (inline))
    (list
      (list_item
        (list_marker_minus)
        (paragraph
          (inline)))
      (list_item
        (list_marker_minus)
        (paragraph
          (inline))))))

================================================================================
Example 284 - https://github.github.com/gfm/#example-284
================================================================================
The number of windows in my house is
14.  The number of doors is 6.

--------------------------------------------------------------------------------

(document
  (section
    (paragraph
      (inline))))

================================================================================
Example 285 - https://github.github.com/gfm/#example-285
================================================================================
The number of windows in my house is
1.  The number of doors is 6.

--------------------------------------------------------------------------------

(document
  (section
    (paragraph
      (inline))
    (list
      (list_item
        (list_marker_dot)
        (paragraph
          (inline))))))

================================================================================
Example 286 - https://github.github.com/gfm/#example-286
================================================================================
- foo

- bar


- baz

--------------------------------------------------------------------------------

(document
  (section
    (list
      (list_item
        (list_marker_minus)
        (paragraph
          (inline)
          (block_continuation)))
      (list_item
        (list_marker_minus)
        (paragraph
          (inline)
          (block_continuation))
        (block_continuation))
      (list_item
        (list_marker_minus)
        (paragraph
          (inline))))))

================================================================================
Example 287 - https://github.github.com/gfm/#example-287
================================================================================
- foo
  - bar
    - baz


      bim

--------------------------------------------------------------------------------

(document
  (section
    (list
      (list_item
        (list_marker_minus)
        (paragraph
          (inline)
          (block_continuation))
        (list
          (list_item
            (list_marker_minus)
            (paragraph
              (inline)
              (block_continuation))
            (list
              (list_item
                (list_marker_minus)
                (paragraph
                  (inline)
                  (block_continuation))
                (block_continuation)
                (block_continuation)
                (paragraph
                  (inline))))))))))

================================================================================
Example 288 - https://github.github.com/gfm/#example-288
================================================================================
- foo
- bar

<!-- -->

- baz
- bim

--------------------------------------------------------------------------------

(document
  (section
    (list
      (list_item
        (list_marker_minus)
        (paragraph
          (inline)))
      (list_item
        (list_marker_minus)
        (paragraph
          (inline)
          (block_continuation))))
    (html_block)
    (list
      (list_item
        (list_marker_minus)
        (paragraph
          (inline)))
      (list_item
        (list_marker_minus)
        (paragraph
          (inline))))))

================================================================================
Example 289 - https://github.github.com/gfm/#example-289
================================================================================
-   foo

    notcode

-   foo

<!-- -->

    code

--------------------------------------------------------------------------------

(document
  (section
    (list
      (list_item
        (list_marker_minus)
        (paragraph
          (inline)
          (block_continuation))
        (block_continuation)
        (paragraph
          (inline)
          (block_continuation)))
      (list_item
        (list_marker_minus)
        (paragraph
          (inline)
          (block_continuation))))
    (html_block)
    (indented_code_block)))

================================================================================
Example 290 - https://github.github.com/gfm/#example-290
================================================================================
- a
 - b
  - c
   - d
  - e
 - f
- g

--------------------------------------------------------------------------------

(document
  (section
    (list
      (list_item
        (list_marker_minus)
        (paragraph
          (inline)))
      (list_item
        (list_marker_minus)
        (paragraph
          (inline)))
      (list_item
        (list_marker_minus)
        (paragraph
          (inline)))
      (list_item
        (list_marker_minus)
        (paragraph
          (inline)))
      (list_item
        (list_marker_minus)
        (paragraph
          (inline)))
      (list_item
        (list_marker_minus)
        (paragraph
          (inline)))
      (list_item
        (list_marker_minus)
        (paragraph
          (inline))))))

================================================================================
Example 291 - https://github.github.com/gfm/#example-291
================================================================================
1. a

  2. b

   3. c

--------------------------------------------------------------------------------

(document
  (section
    (list
      (list_item
        (list_marker_dot)
        (paragraph
          (inline)
          (block_continuation)))
      (list_item
        (list_marker_dot)
        (paragraph
          (inline)
          (block_continuation)))
      (list_item
        (list_marker_dot)
        (paragraph
          (inline))))))

================================================================================
Example 292 - https://github.github.com/gfm/#example-292
================================================================================
- a
 - b
  - c
   - d
    - e

--------------------------------------------------------------------------------

(document
  (section
    (list
      (list_item
        (list_marker_minus)
        (paragraph
          (inline)))
      (list_item
        (list_marker_minus)
        (paragraph
          (inline)))
      (list_item
        (list_marker_minus)
        (paragraph
          (inline)))
      (list_item
        (list_marker_minus)
        (paragraph
          (inline))))))

================================================================================
Example 293 - https://github.github.com/gfm/#example-293
================================================================================
1. a

  2. b

    3. c

--------------------------------------------------------------------------------

(document
  (section
    (list
      (list_item
        (list_marker_dot)
        (paragraph
          (inline)
          (block_continuation)))
      (list_item
        (list_marker_dot)
        (paragraph
          (inline)
          (block_continuation))))
    (indented_code_block)))

================================================================================
Example 294 - https://github.github.com/gfm/#example-294
================================================================================
- a
- b

- c

--------------------------------------------------------------------------------

(document
  (section
    (list
      (list_item
        (list_marker_minus)
        (paragraph
          (inline)))
      (list_item
        (list_marker_minus)
        (paragraph
          (inline)
          (block_continuation)))
      (list_item
        (list_marker_minus)
        (paragraph
          (inline))))))

================================================================================
Example 295 - https://github.github.com/gfm/#example-295
================================================================================
* a
*

* c

--------------------------------------------------------------------------------

(document
  (section
    (list
      (list_item
        (list_marker_star)
        (paragraph
          (inline)))
      (list_item
        (list_marker_star)
        (block_continuation))
      (list_item
        (list_marker_star)
        (paragraph
          (inline))))))

================================================================================
Example 296 - https://github.github.com/gfm/#example-296
================================================================================
- a
- b

  c
- d

--------------------------------------------------------------------------------

(document
  (section
    (list
      (list_item
        (list_marker_minus)
        (paragraph
          (inline)))
      (list_item
        (list_marker_minus)
        (paragraph
          (inline)
          (block_continuation))
        (block_continuation)
        (paragraph
          (inline)))
      (list_item
        (list_marker_minus)
        (paragraph
          (inline))))))

================================================================================
Example 297 - https://github.github.com/gfm/#example-297
================================================================================
- a
- b

  [ref]: /url
- d

--------------------------------------------------------------------------------

(document
  (section
    (list
      (list_item
        (list_marker_minus)
        (paragraph
          (inline)))
      (list_item
        (list_marker_minus)
        (paragraph
          (inline)
          (block_continuation))
        (block_continuation)
        (link_reference_definition
          (link_label)
          (link_destination)))
      (list_item
        (list_marker_minus)
        (paragraph
          (inline))))))

================================================================================
Example 298 - https://github.github.com/gfm/#example-298
================================================================================
- a
- ```
  b


  ```
- c

--------------------------------------------------------------------------------

(document
  (section
    (list
      (list_item
        (list_marker_minus)
        (paragraph
          (inline)))
      (list_item
        (list_marker_minus)
        (fenced_code_block
          (fenced_code_block_delimiter)
          (block_continuation)
          (code_fence_content
            (block_continuation)
            (block_continuation)
            (block_continuation))
          (fenced_code_block_delimiter)))
      (list_item
        (list_marker_minus)
        (paragraph
          (inline))))))

================================================================================
Example 299 - https://github.github.com/gfm/#example-299
================================================================================
- a
  - b

    c
- d

--------------------------------------------------------------------------------

(document
  (section
    (list
      (list_item
        (list_marker_minus)
        (paragraph
          (inline)
          (block_continuation))
        (list
          (list_item
            (list_marker_minus)
            (paragraph
              (inline)
              (block_continuation))
            (block_continuation)
            (paragraph
              (inline)))))
      (list_item
        (list_marker_minus)
        (paragraph
          (inline))))))

================================================================================
Example 300 - https://github.github.com/gfm/#example-300
================================================================================
* a
  > b
  >
* c

--------------------------------------------------------------------------------

(document
  (section
    (list
      (list_item
        (list_marker_star)
        (paragraph
          (inline)
          (block_continuation))
        (block_quote
          (block_quote_marker)
          (paragraph
            (inline)
            (block_continuation))))
      (list_item
        (list_marker_star)
        (paragraph
          (inline))))))

================================================================================
Example 301 - https://github.github.com/gfm/#example-301
================================================================================
- a
  > b
  ```
  c
  ```
- d

--------------------------------------------------------------------------------

(document
  (section
    (list
      (list_item
        (list_marker_minus)
        (paragraph
          (inline)
          (block_continuation))
        (block_quote
          (block_quote_marker)
          (paragraph
            (inline)
            (block_continuation)))
        (fenced_code_block
          (fenced_code_block_delimiter)
          (block_continuation)
          (code_fence_content
            (block_continuation))
          (fenced_code_block_delimiter)))
      (list_item
        (list_marker_minus)
        (paragraph
          (inline))))))

================================================================================
Example 302 - https://github.github.com/gfm/#example-302
================================================================================
- a

--------------------------------------------------------------------------------

(document
  (section
    (list
      (list_item
        (list_marker_minus)
        (paragraph
          (inline))))))

================================================================================
Example 303 - https://github.github.com/gfm/#example-303
================================================================================
- a
  - b

--------------------------------------------------------------------------------

(document
  (section
    (list
      (list_item
        (list_marker_minus)
        (paragraph
          (inline)
          (block_continuation))
        (list
          (list_item
            (list_marker_minus)
            (paragraph
              (inline))))))))

================================================================================
Example 304 - https://github.github.com/gfm/#example-304
================================================================================
1. ```
   foo
   ```

   bar

--------------------------------------------------------------------------------

(document
  (section
    (list
      (list_item
        (list_marker_dot)
        (fenced_code_block
          (fenced_code_block_delimiter)
          (block_continuation)
          (code_fence_content
            (block_continuation))
          (fenced_code_block_delimiter)
          (block_continuation))
        (block_continuation)
        (paragraph
          (inline))))))

================================================================================
Example 305 - https://github.github.com/gfm/#example-305
================================================================================
* foo
  * bar

  baz

--------------------------------------------------------------------------------

(document
  (section
    (list
      (list_item
        (list_marker_star)
        (paragraph
          (inline)
          (block_continuation))
        (list
          (list_item
            (list_marker_star)
            (paragraph
              (inline)
              (block_continuation))
            (block_continuation)))
        (paragraph
          (inline))))))

================================================================================
Example 306 - https://github.github.com/gfm/#example-306
================================================================================
- a
  - b
  - c

- d
  - e
  - f

--------------------------------------------------------------------------------

(document
  (section
    (list
      (list_item
        (list_marker_minus)
        (paragraph
          (inline)
          (block_continuation))
        (list
          (list_item
            (list_marker_minus)
            (paragraph
              (inline)
              (block_continuation)))
          (list_item
            (list_marker_minus)
            (paragraph
              (inline)
              (block_continuation)))))
      (list_item
        (list_marker_minus)
        (paragraph
          (inline)
          (block_continuation))
        (list
          (list_item
            (list_marker_minus)
            (paragraph
              (inline)
              (block_continuation)))
          (list_item
            (list_marker_minus)
            (paragraph
              (inline))))))))

================================================================================
Example 314 - https://github.github.com/gfm/#example-314
================================================================================
    \[\]

--------------------------------------------------------------------------------

(document
  (section
    (indented_code_block)))

================================================================================
Example 315 - https://github.github.com/gfm/#example-315
================================================================================
~~~
\[\]
~~~

--------------------------------------------------------------------------------

(document
  (section
    (fenced_code_block
      (fenced_code_block_delimiter)
      (block_continuation)
      (code_fence_content
        (block_continuation))
      (fenced_code_block_delimiter))))

================================================================================
Example 319 - https://github.github.com/gfm/#example-319
================================================================================
[foo]

[foo]: /bar\* "ti\*tle"

--------------------------------------------------------------------------------

(document
  (section
    (paragraph
      (inline))
    (link_reference_definition
      (link_label)
      (link_destination
        (backslash_escape))
      (link_title
        (backslash_escape)))))

================================================================================
Example 320 - https://github.github.com/gfm/#example-320
================================================================================
``` foo\+bar
foo
```

--------------------------------------------------------------------------------

(document
  (section
    (fenced_code_block
      (fenced_code_block_delimiter)
      (info_string
        (language
          (backslash_escape)))
      (block_continuation)
      (code_fence_content
        (block_continuation))
      (fenced_code_block_delimiter))))

================================================================================
Example 329 - https://github.github.com/gfm/#example-329
================================================================================
[foo]

[foo]: /f&ouml;&ouml; "f&ouml;&ouml;"

--------------------------------------------------------------------------------

(document
  (section
    (paragraph
      (inline))
    (link_reference_definition
      (link_label)
      (link_destination
        (entity_reference)
        (entity_reference))
      (link_title
        (entity_reference)
        (entity_reference)))))

================================================================================
Example 330 - https://github.github.com/gfm/#example-330
================================================================================
``` f&ouml;&ouml;
foo
```

--------------------------------------------------------------------------------

(document
  (section
    (fenced_code_block
      (fenced_code_block_delimiter)
      (info_string
        (language
          (entity_reference)
          (entity_reference)))
      (block_continuation)
      (code_fence_content
        (block_continuation))
      (fenced_code_block_delimiter))))

================================================================================
Example 332 - https://github.github.com/gfm/#example-332
================================================================================
    f&ouml;f&ouml;

--------------------------------------------------------------------------------

(document
  (section
    (indented_code_block)))

================================================================================
Example 334 - https://github.github.com/gfm/#example-334
================================================================================
&#42; foo

* foo

--------------------------------------------------------------------------------

(document
  (section
    (paragraph
      (inline))
    (list
      (list_item
        (list_marker_star)
        (paragraph
          (inline))))))
